// ============================================================
// Image: ACTk.Runtime.dll
// ============================================================

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x66DDF0
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x66DDF0
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class dan
{
public:

    // Methods
    static MonoScriptData gnk();  // RVA: 0x66EAA0
    void .ctor();  // RVA: 0x628380
    static MonoScriptData vza();  // RVA: 0x66EB80
};

// Namespace: <global>
class dao
{
public:

    // Methods
    static void vzc();  // RVA: 0x632CB0
    static void eew();  // RVA: 0x632CB0
    static void faq();  // RVA: 0x632CB0
    static void kee();  // RVA: 0x632CB0
    static void vzb();  // RVA: 0x632CB0
};

// Namespace: <global>
class ApplicationFocusEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x66DCE0
    void Invoke(bool hasFocus);  // RVA: 0x66DCD0
    IAsyncResult* BeginInvoke(bool hasFocus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x66DC60
    void EndInvoke(IAsyncResult* result);  // RVA: 0x66DCC0
};

// Namespace: <global>
class ApplicationPauseEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x66DCE0
    void Invoke(bool pauseStatus);  // RVA: 0x66DCD0
    IAsyncResult* BeginInvoke(bool pauseStatus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x66DC60
    void EndInvoke(IAsyncResult* result);  // RVA: 0x66DCC0
};

// Namespace: <global>
class dap : public MonoBehaviour
{
public:
    // Static fields
    // static dap* bmod;

    uint8_t pad_0000[0x20]; // 0x0000
    ApplicationFocusEventHandler* bmob; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    ApplicationPauseEventHandler* bmoc; // 0x0028

    // Methods
    void igb(bool hasFocus);  // RVA: 0x66ED00
    void vze(ApplicationFocusEventHandler* a);  // RVA: 0x66EE80
    void Awake();  // RVA: 0x66EC60
    void vzf(ApplicationPauseEventHandler* a);  // RVA: 0x66EF20
    static dap* vzh();  // RVA: 0x66F060
    void OnApplicationPause(bool pauseStatus);  // RVA: 0x66ED20
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x66ED00
    void vzg(ApplicationPauseEventHandler* a);  // RVA: 0x66EFC0
    void .ctor();  // RVA: 0x628650
    void nmi();  // RVA: 0x66ED40
    void vzd(ApplicationFocusEventHandler* a);  // RVA: 0x66EDE0
    void dot(bool hasFocus);  // RVA: 0x66ED00
};

// Namespace: <global>
class daq
{
public:

    // Methods
    static Il2CppString* vzk(Il2CppString* a);  // RVA: 0x66FD00
    static Char[][] vzj(Il2CppString* a);  // RVA: 0x66FC60
    static Il2CppString* bvw(Il2CppString* a);  // RVA: 0x66F190
    static Il2CppString* vzi(Il2CppString* a);  // RVA: 0x66FBC0
    static Char[][] eho(Il2CppString* a);  // RVA: 0x66F580
    static Il2CppString* hoa(Char[][] a);  // RVA: 0x66F620
    static Il2CppString* mta(Il2CppString* a);  // RVA: 0x66FAA0
    static Il2CppString* mor(Char[][] a);  // RVA: 0x66F990
    static Il2CppString* vzl(Char[][] a);  // RVA: 0x66FE20
    static Il2CppString* dlq(Char[][] a);  // RVA: 0x66F470
    static Il2CppString* ikt(Il2CppString* a);  // RVA: 0x66F730
    static Il2CppString* lku(Il2CppString* a);  // RVA: 0x66F8F0
    static Il2CppString* ktp(Il2CppString* a);  // RVA: 0x66F850
    static Il2CppString* cl(Il2CppString* a);  // RVA: 0x66F350
    static Char[][] byf(Il2CppString* a);  // RVA: 0x66F2B0
};

// Namespace: <global>
class dar
{
public:
    // Static fields
    // static int32_t bmoe;
    // static uint8_t bmof;
    // static uint8_t bmog;
    // static uint8_t bmoh;
    // static uint8_t bmoi;
    // static uint8_t bmoj;


    // Methods
    static void vzq(Stream* a, Stream* b, Byte[][] c, uint8_t d);  // RVA: 0x563E10
    static void vzm(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x670160
    static void eoe(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66FF30
    static void vzo(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x670240
    static void vzp(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6702B0
    static void vzr(Stream* a, Stream* b, Byte[][] c, uint8_t d, uint8_t e);  // RVA: 0x4367D0
    static void imb(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x670080
    static void hlh(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66FFA0
    static void igs(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x670010
    static void vzn(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6701D0
    static void nmg(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6700F0
};

// Namespace: <global>
class das
{
public:
    // Static fields
    // static int32_t bmok;


    // Methods
    static bool vm(Decimal a, int32_t b);  // RVA: 0x670750
    static int32_t waj(a a);  // RVA: 0x563E10
    static bool igj(uint64_t a, int32_t b);  // RVA: 0x671090
    static bool wab(Vector2Int a, int32_t b);  // RVA: 0x672B90
    static int32_t jxl(Vector3Int a);  // RVA: 0x671A70
    static bool vzs(BigInteger a, int32_t b);  // RVA: 0x672B60
    static bool vzy(uint64_t a, int32_t b);  // RVA: 0x671090
    static bool vzz(Quaternion a, int32_t b);  // RVA: 0x670E00
    static bool waa(Vector2 a, int32_t b);  // RVA: 0x6706A0
    static bool dq(int64_t a, int32_t b);  // RVA: 0x670320
    static bool wac(Vector3 a, int32_t b);  // RVA: 0x670C00
    static int32_t wbb(Char[][] a);  // RVA: 0x673930
    static bool dow(float a, int32_t b);  // RVA: 0x6707B0
    static int32_t jwf(Decimal a);  // RVA: 0x671840
    static int32_t eoz(float a);  // RVA: 0x670B80
    static int32_t waw(Quaternion a);  // RVA: 0x670420
    static int32_t ia(int64_t a);  // RVA: 0x671000
    static bool jnq(DateTimeOffset a, int32_t b);  // RVA: 0x6717B0
    static int32_t nhz(uint64_t a);  // RVA: 0x672740
    static int32_t cek(Char[][] a);  // RVA: 0x670650
    static int32_t frt(DateTime a);  // RVA: 0x670D10
    static int32_t ofe(DateTimeOffset a);  // RVA: 0x672A80
    static bool brt(int64_t a, int32_t b);  // RVA: 0x670320
    static bool mep(Vector2 a, int32_t b);  // RVA: 0x6706A0
    static bool ego(Vector3Int a, int32_t b);  // RVA: 0x6708B0
    static int32_t dxd(Vector2Int a);  // RVA: 0x670810
    static bool wad(Vector3Int a, int32_t b);  // RVA: 0x6708B0
    static int32_t wat(uint64_t a);  // RVA: 0x6735E0
    static int32_t way(Vector2Int a);  // RVA: 0x670810
    static int32_t ixm(BigInteger a);  // RVA: 0x6714C0
    static int32_t jwu(Vector3Int a);  // RVA: 0x671970
    static int32_t nth(BigInteger a);  // RVA: 0x672790
    static int32_t wau(float a);  // RVA: 0x670B80
    static int32_t waz(Vector3 a);  // RVA: 0x673740
    static int32_t bxt(Char[][] a);  // RVA: 0x6703D0
    static int32_t hyz(DateTimeOffset a);  // RVA: 0x670F20
    static bool nyo(float a, int32_t b);  // RVA: 0x6707B0
    static int32_t wal(bool a);  // RVA: 0x672F30
    static bool ixy(DateTimeOffset a, int32_t b);  // RVA: 0x6717B0
    static bool vzx(uint32_t a, int32_t b);  // RVA: 0x670EB0
    static int32_t eor(Guid a);  // RVA: 0x670900
    static int32_t lds(Il2CppString* a);  // RVA: 0x671DD0
    static int32_t wao(DateTime a);  // RVA: 0x673110
    static int32_t wav(double a);  // RVA: 0x673680
    static bool joa(Char[][] a, int32_t b);  // RVA: 0x6717E0
    static int32_t cb(Quaternion a);  // RVA: 0x670420
    static bool hds(double a, int32_t b);  // RVA: 0x670780
    static bool mwr(Quaternion a, int32_t b);  // RVA: 0x670E00
    static int32_t cdt(Quaternion a);  // RVA: 0x670420
    static bool cvm(Decimal a, int32_t b);  // RVA: 0x670750
    static int32_t lo(Char[][] a);  // RVA: 0x671EA0
    static int32_t ipq(Guid a);  // RVA: 0x671240
    static bool ilb(Guid a, int32_t b);  // RVA: 0x670BD0
    static int32_t wan(int32_t a);  // RVA: 0x671E50
    static int32_t mkd(float a);  // RVA: 0x670B80
    static int32_t was(uint32_t a);  // RVA: 0x671E50
    static int32_t lej(uint32_t a);  // RVA: 0x671E50
    static int32_t wam(Decimal a);  // RVA: 0x672F40
    static int32_t ktz(DateTimeOffset a);  // RVA: 0x671CF0
    static int32_t mlx(BigInteger a);  // RVA: 0x6720C0
    static int32_t wak(BigInteger a);  // RVA: 0x672C40
    static bool fil(double a, int32_t b);  // RVA: 0x670780
    static int32_t kjg(Il2CppString* a);  // RVA: 0x671B80
    static int32_t lpj(DateTimeOffset a);  // RVA: 0x671EF0
    static bool euz(Guid a, int32_t b);  // RVA: 0x670BD0
    static int32_t wax(Vector2 a);  // RVA: 0x6736A0
    static bool fwe(Quaternion a, int32_t b);  // RVA: 0x670E00
    static bool vzt(bool a, int32_t b);  // RVA: 0x670F00
    static int32_t waq(Guid a);  // RVA: 0x6732E0
    static bool khb(bool a, int32_t b);  // RVA: 0x670F00
    static bool ntu(Decimal a, int32_t b);  // RVA: 0x670750
    static int32_t oja(Quaternion a);  // RVA: 0x670420
    static bool wah(DateTimeOffset a, int32_t b);  // RVA: 0x6717B0
    static int32_t kik(bool a);  // RVA: 0x671B70
    static int32_t ilu(bool a);  // RVA: 0x671230
    static bool vzv(int32_t a, int32_t b);  // RVA: 0x670EB0
    static int32_t th(Quaternion a);  // RVA: 0x670420
    static int32_t nem(uint64_t a);  // RVA: 0x6726A0
    static int32_t ktb(DateTime a);  // RVA: 0x671C00
    static int32_t wba(Vector3Int a);  // RVA: 0x673830
    static bool fmo(Vector3 a, int32_t b);  // RVA: 0x670C00
    static int32_t wbc(Il2CppString* a);  // RVA: 0x673980
    static int32_t cee(Vector3Int a);  // RVA: 0x670560
    static bool hgq(bool a, int32_t b);  // RVA: 0x670F00
    static int32_t fwq(Il2CppString* a);  // RVA: 0x670E30
    static int32_t mti(BigInteger a);  // RVA: 0x6723B0
    static int32_t kmi(int64_t a);  // RVA: 0x671000
    static bool jwj(int64_t a, int32_t b);  // RVA: 0x670320
    static bool kvv(Vector3 a, int32_t b);  // RVA: 0x670C00
    static int32_t ihz(DateTime a);  // RVA: 0x671140
    static bool cif(Vector2 a, int32_t b);  // RVA: 0x6706A0
    static bool dls(double a, int32_t b);  // RVA: 0x670780
    static bool kyo(Guid a, int32_t b);  // RVA: 0x670BD0
    static int32_t war(int64_t a);  // RVA: 0x673540
    static bool exv(Vector3 a, int32_t b);  // RVA: 0x670C00
    static bool wae(float a, int32_t b);  // RVA: 0x6707B0
    static bool hpn(int64_t a, int32_t b);  // RVA: 0x670320
    static bool gem(uint32_t a, int32_t b);  // RVA: 0x670EB0
    static bool knz(Guid a, int32_t b);  // RVA: 0x670BD0
    static bool wai(Guid a, int32_t b);  // RVA: 0x670BD0
    static bool hdr(double a, int32_t b);  // RVA: 0x670780
    static bool wag(Char[][] a, int32_t b);  // RVA: 0x6717E0
    static bool vzu(Decimal a, int32_t b);  // RVA: 0x670750
    static int32_t ekc(double a);  // RVA: 0x6708E0
    static int32_t wap(DateTimeOffset a);  // RVA: 0x673200
    static bool waf(double a, int32_t b);  // RVA: 0x670780
    static int32_t maf(DateTime a);  // RVA: 0x671FD0
    static bool vzw(int64_t a, int32_t b);  // RVA: 0x670320
};

// Namespace: <global>
class dat : public CertificateHandler
{
public:

    // Methods
    bool ValidateCertificate(Byte[][] certificateData);  // RVA: 0x673A00
    void .ctor();  // RVA: 0x673A10
};

// Namespace: <global>
class dau
{
public:

    // Methods
    static bool hut(float a, float b, float c);  // RVA: 0x673A20
    static bool ooe(double a, double b, double c);  // RVA: 0x673D30
    static bool wbe(double a, double b, double c);  // RVA: 0x673F10
    static bool mza(double a, double b, double c);  // RVA: 0x673C00
    static bool kjo(double a, double b, double c);  // RVA: 0x673AD0
    static bool wbd(float a, float b, float c);  // RVA: 0x673E60
};

// Namespace: <global>
class dav
{
public:

    // Methods
    static void wbf(System.IProgress<CodeStage.AntiCheat.Genuine.CodeHash.FilesProgress> a, int32_t b, int32_t c, int64_t d, Il2CppString* e);  // RVA: 0x674040
};

// Namespace: <global>
class daw
{
public:

    // Methods
    static void jhw(Char[][] a);  // RVA: 0x674920
    static uint16_t wbl();  // RVA: 0x674ED0
    static int32_t wbm();  // RVA: 0x6746F0
    static wchar_t wbj();  // RVA: 0x674E30
    static int64_t obv();  // RVA: 0x674C60
    static int64_t wbo();  // RVA: 0x6748C0
    static int64_t hof();  // RVA: 0x6746A0
    static uint8_t djv();  // RVA: 0x6742F0
    static void wbq(Char[][] a);  // RVA: 0x674F20
    static Il2CppString* wbg(int32_t a);  // RVA: 0x674CB0
    static uint32_t ieh();  // RVA: 0x6746F0
    static wchar_t gxw();  // RVA: 0x674600
    static uint64_t wbp();  // RVA: 0x6748C0
    static uint8_t biv();  // RVA: 0x674170
    static uint8_t wbh();  // RVA: 0x674D90
    static void nhd(Char[][] a);  // RVA: 0x674BD0
    static int16_t kro();  // RVA: 0x674A90
    static int32_t epv();  // RVA: 0x674420
    static int8_t mda();  // RVA: 0x674B30
    static int8_t gwn();  // RVA: 0x6745B0
    static int8_t bwi();  // RVA: 0x6741C0
    static uint8_t inu();  // RVA: 0x674820
    static Il2CppString* kla(int32_t a);  // RVA: 0x6749B0
    static wchar_t mtk();  // RVA: 0x674B80
    static int16_t llb();  // RVA: 0x674AE0
    static int16_t gpl();  // RVA: 0x674510
    static int8_t wbi();  // RVA: 0x674DE0
    static uint32_t wbn();  // RVA: 0x6746F0
    static uint16_t fsh();  // RVA: 0x674470
    static int8_t hec();  // RVA: 0x674650
    static int32_t ios();  // RVA: 0x674870
    static uint32_t ktp();  // RVA: 0x6746F0
    static uint8_t gcw();  // RVA: 0x6744C0
    static uint32_t nbl();  // RVA: 0x6746F0
    static Il2CppString* dun(int32_t a);  // RVA: 0x674340
    static Il2CppString* iia(int32_t a);  // RVA: 0x674740
    static int16_t wbk();  // RVA: 0x674E80
    static uint64_t ivp();  // RVA: 0x6748C0
    static wchar_t gwd();  // RVA: 0x674560
    static int64_t cfh();  // RVA: 0x674210
    static void dim(Char[][] a);  // RVA: 0x674260
};

// Namespace: <global>
class dax
{
public:
    // Static fields
    // static Char[][] bmol;


    // Methods
    static Byte[][] lru(Il2CppString* a);  // RVA: 0x6750E0
    static Il2CppString* htg(Byte[][] a);  // RVA: 0x675170
    static Il2CppString* low(Byte[][] a);  // RVA: 0x675170
    static Il2CppString* lod(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x675040
    static Il2CppString* wbv(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x675040
    static Il2CppString* dgj(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x675040
    static Char[][] wbt(Byte[][] a);  // RVA: 0x675130
    static Il2CppString* jjp(Byte[][] a);  // RVA: 0x675170
    static void .cctor();  // RVA: 0x674FB0
    static Byte[][] kml(Char[][] a);  // RVA: 0x6750A0
    static Il2CppString* wbu(Byte[][] a);  // RVA: 0x675170
    static Byte[][] dkf(Char[][] a);  // RVA: 0x6750A0
    static Byte[][] wbs(Il2CppString* a);  // RVA: 0x6750E0
    static Char[][] mbf(Byte[][] a);  // RVA: 0x675130
    static Il2CppString* bfc(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x675040
    static Il2CppString* mes(Byte[][] a);  // RVA: 0x675170
    static Byte[][] fdg(Il2CppString* a);  // RVA: 0x6750E0
    static Byte[][] wbr(Char[][] a);  // RVA: 0x6750A0
    static Char[][] gmh(Byte[][] a);  // RVA: 0x675130
    static Byte[][] nzm(Char[][] a);  // RVA: 0x6750A0
    static Il2CppString* wbw(Byte[][] a);  // RVA: 0x6751B0
};

// Namespace: <global>
class day`1
{
public:
    System.Collections.Concurrent.ConcurrentBag<a> bmom; // 0x0000
    System.Func<a> bmon; // 0x0000

    // Methods
    void wbz();  // RVA: 0x42DF20
    a wbx();  // RVA: 0x563E10
    void jwm();  // RVA: 0x42DF20
    void .ctor(System.Func<a> a);  // RVA: 0x4186E0
    void wby(a a);  // RVA: 0x563E10
};

// Namespace: <global>
class daz
{
public:
    // Static fields
    // static Random* bmoo;
    // static Random* bmop;


    // Methods
    static int32_t wca(int32_t a, int32_t b);  // RVA: 0x676AF0
    static void bjm(Byte[][] a);  // RVA: 0x6753B0
    static void wcc(Byte[][] a);  // RVA: 0x676F80
    static void fgd(Byte[][] a);  // RVA: 0x675C40
    static int64_t wce(Random* a, int64_t b, int64_t c);  // RVA: 0x677520
    static void dio(Char[][] a);  // RVA: 0x675930
    static void .cctor();  // RVA: 0x675330
    static void wcd(Char[][] a);  // RVA: 0x677210
    static int64_t cyi(int64_t a, int64_t b);  // RVA: 0x6756C0
    static int64_t hxg(Random* a, int64_t b, int64_t c);  // RVA: 0x6761B0
    static int64_t xc(Random* a, int64_t b, int64_t c);  // RVA: 0x677630
    static void wcf(Random* a, Char[][] b);  // RVA: 0x6775A0
    static void inc(Char[][] a);  // RVA: 0x676220
    static void ir(Random* a, Char[][] b);  // RVA: 0x676530
    static int64_t byp(Random* a, int64_t b, int64_t c);  // RVA: 0x675640
    static void lvm(Byte[][] a);  // RVA: 0x676860
    static void lrw(Byte[][] a);  // RVA: 0x6765D0
    static int64_t fpc(int64_t a, int64_t b);  // RVA: 0x675ED0
    static int64_t wcb(int64_t a, int64_t b);  // RVA: 0x676D10
    static int64_t gxg(Random* a, int64_t b, int64_t c);  // RVA: 0x676140
};

// Namespace: <global>
class dba
{
public:
    // Static fields
    // static int64_t bmoq;


    // Methods
    static double wch();  // RVA: 0x6778E0
    static double osc();  // RVA: 0x677810
    static int64_t wck();  // RVA: 0x677990
    static int64_t wci();  // RVA: 0x677950
    static int64_t iyb();  // RVA: 0x677760
    static int64_t wcg();  // RVA: 0x677880
    static int64_t wcj();  // RVA: 0x677970
    static int64_t iet();  // RVA: 0x677740
    static double omt();  // RVA: 0x6777A0
    static int64_t koy();  // RVA: 0x677780
    static double fxo();  // RVA: 0x6776D0
    static int64_t bod();  // RVA: 0x6776B0
};

// Namespace: <global>
class dbb
{
public:
    // Static fields
    // static uint32_t bmor;
    // static uint32_t bmos;
    // static uint32_t bmot;
    // static uint32_t bmou;
    // static uint32_t bmov;


    // Methods
    static uint32_t ksu(Stream* a, int64_t b, uint32_t c);  // RVA: 0x677BF0
    static uint32_t low(Stream* a, int64_t b, uint32_t c);  // RVA: 0x677F40
    static uint32_t gob(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x6779B0
    static uint32_t ohb(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x678230
    static uint32_t wcm(Stream* a, int64_t b, uint32_t c);  // RVA: 0x6787C0
    static uint32_t wcl(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x678390
};

// Namespace: <global>
class dbc : public dcy`1
{
public:
    // Static fields
    // static bool bmow;
    // static bool bmox;
    // static float bmoy;
    // static float bmoz;
    // static float bmpa;
    // static float bmpb;
    // static float bmpc;
    // static float bmpd;
    // static bool bmpe;

    uint8_t pad_0000[0x30]; // 0x0000
    int64_t bmpf; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    int64_t bmpg; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    int64_t bmph; // 0x0040

    // Methods
    void Update();  // RVA: 0x678C20
    bool wcx();  // RVA: 0x67A190
    bool hot();  // RVA: 0x679690
    static void dew();  // RVA: 0x679240
    void mtm();  // RVA: 0x679940
    static float wcr();  // RVA: 0x679E70
    void doo();  // RVA: 0x6792B0
    static void wco();  // RVA: 0x679AC0
    static float wcv();  // RVA: 0x67A170
    static float wct();  // RVA: 0x679FF0
    static void wcn();  // RVA: 0x679A50
    static float wcs();  // RVA: 0x679F30
    static float wcp();  // RVA: 0x679CF0
    void wda();  // RVA: 0x67A580
    static void flk();  // RVA: 0x679460
    void icp();  // RVA: 0x6798A0
    void .ctor();  // RVA: 0x678E80
    void cgj();  // RVA: 0x679170
    static void wcw(float a);  // RVA: 0x67A180
    void bhg();  // RVA: 0x678EC0
    bool zt();  // RVA: 0x67A6A0
    void wcy();  // RVA: 0x67A3A0
    bool bvm();  // RVA: 0x678F60
    static float wcu();  // RVA: 0x67A0B0
    void esu();  // RVA: 0x679350
    static float wcq();  // RVA: 0x679DB0
    void wdb(Scene a, LoadSceneMode b);  // RVA: 0x67A620
    void wcz();  // RVA: 0x67A470
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct StorageDataType
    {
    public:
        // Static fields
        // static StorageDataType Unknown;
        // static StorageDataType SByte;
        // static StorageDataType Byte;
        // static StorageDataType Int16;
        // static StorageDataType UInt16;
        // static StorageDataType Int32;
        // static StorageDataType UInt32;
        // static StorageDataType Int64;
        // static StorageDataType UInt64;
        // static StorageDataType Char;
        // static StorageDataType Single;
        // static StorageDataType Double;
        // static StorageDataType Decimal;
        // static StorageDataType BigInteger;
        // static StorageDataType Boolean;
        // static StorageDataType String;
        // static StorageDataType DateTime;
        // static StorageDataType ByteArray;
        // static StorageDataType Vector2;
        // static StorageDataType Vector2Int;
        // static StorageDataType Vector3;
        // static StorageDataType Vector3Int;
        // static StorageDataType Vector4;
        // static StorageDataType Quaternion;
        // static StorageDataType Color;
        // static StorageDataType Color32;
        // static StorageDataType Rect;
        // static StorageDataType RectInt;
        // static StorageDataType RangeInt;
        // static StorageDataType Matrix4x4;
        // static StorageDataType Ray;
        // static StorageDataType Ray2D;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredPrefsData
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        StorageDataType type; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Byte[][] data; // 0x0018
    
        // Methods
        void .ctor(StorageDataType type, Byte[][] data);  // RVA: 0x66E980
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbd
{
public:

    // Methods
    static f wdi(StorageDataType a, Byte[][] b);  // RVA: 0x563E10
    static d wdg(StorageDataType a, Byte[][] b);  // RVA: 0x563E10
    static T wdk(Byte[][] a);  // RVA: 0x563E10
    static Color32 nab(Byte[][] a);  // RVA: 0x67A8E0
    static Byte[][] wdj(T a);  // RVA: 0x563E10
    static c wdf(Byte[][] a);  // RVA: 0x563E10
    static Color32 wdc(Byte[][] a);  // RVA: 0x67A920
    static b wde(ObscuredPrefsData a);  // RVA: 0x563E10
    static Color32 lzu(Byte[][] a);  // RVA: 0x67A8B0
    static Byte[][] wdh(StorageDataType a, e b);  // RVA: 0x563E10
    static ObscuredPrefsData wdd(a a);  // RVA: 0x563E10
};

// Namespace: <global>
class dbe
{
public:
    // Static fields
    // static Type* bmpi;
    // static Type* bmpj;
    // static Type* bmpk;
    // static Type* bmpl;
    // static Type* bmpm;
    // static Type* bmpn;
    // static Type* bmpo;
    // static Type* bmpp;
    // static Type* bmpq;
    // static Type* bmpr;
    // static Type* bmps;
    // static Type* bmpt;
    // static Type* bmpu;
    // static Type* bmpv;
    // static Type* bmpw;
    // static Type* bmpx;
    // static Type* bmpy;
    // static Type* bmpz;
    // static Type* bmqa;
    // static Type* bmqb;
    // static Type* bmqc;
    // static Type* bmqd;
    // static Type* bmqe;
    // static Type* bmqf;
    // static Type* bmqg;
    // static Type* bmqh;
    // static Type* bmqi;
    // static Type* bmqj;
    // static Type* bmqk;
    // static Type* bmql;
    // static Type* bmqm;


    // Methods
    static StorageDataType wdl();  // RVA: 0x421400
    static void .cctor();  // RVA: 0x67A960
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    class UnsupportedDataTypeException : public Exception
    {
    public:
    
        // Methods
        void .ctor(Type* type);  // RVA: 0x66EA00
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class HashCheckSumModifierDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x66DE30
    Byte[][] Invoke(Il2CppString* input);  // RVA: 0x66DCD0
    IAsyncResult* BeginInvoke(Il2CppString* input, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x66DE00
    Byte[][] EndInvoke(IAsyncResult* result);  // RVA: 0x66DCC0
};

// Namespace: <global>
class dbf
{
public:
    // Static fields
    // static Il2CppString* bmqn;

    uint8_t pad_0000[0x10]; // 0x0000
    uint32_t bmqo; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    uint32_t bmqp; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    HashCheckSumModifierDelegate* bmqq; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool <bmqr>k__BackingField; // 0x0020

    // Methods
    void wdr(bool a);  // RVA: 0x67BA10
    void me(HashCheckSumModifierDelegate* a);  // RVA: 0x67B580
    uint32_t wdw(Il2CppString* a);  // RVA: 0x67BB80
    static Il2CppString* wdp();  // RVA: 0x67B9D0
    void .ctor(uint32_t a);  // RVA: 0x67B210
    void wdt(HashCheckSumModifierDelegate* a);  // RVA: 0x67B580
    uint32_t hdn(Il2CppString* a);  // RVA: 0x67B450
    uint32_t nmz(Il2CppString* a);  // RVA: 0x67B690
    void wdu(bool a);  // RVA: 0x67BB70
    void lcm(HashCheckSumModifierDelegate* a);  // RVA: 0x67B580
    static void kmg();  // RVA: 0x67B590
    static void fju();  // RVA: 0x67B340
    static void exa();  // RVA: 0x67B240
    bool wdq();  // RVA: 0x66E5D0
    uint32_t wds();  // RVA: 0x67BA20
    static void wdn(Il2CppString* a);  // RVA: 0x67B870
    void wdv();  // RVA: 0x67B440
    void hxk(HashCheckSumModifierDelegate* a);  // RVA: 0x67B580
    void gxp();  // RVA: 0x67B440
    static Il2CppString* wdm();  // RVA: 0x67B7C0
    static void wdo();  // RVA: 0x67B8D0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockLevel
    {
    public:
        // Static fields
        // static DeviceLockLevel None;
        // static DeviceLockLevel Soft;
        // static DeviceLockLevel Strict;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbg
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    DeviceLockLevel <bmqs>k__BackingField; // 0x0010
    DeviceLockTamperingSensitivity <bmqt>k__BackingField; // 0x0011

    // Methods
    DeviceLockLevel wdx();  // RVA: 0x66E8B0
    void wdy(DeviceLockLevel a);  // RVA: 0x67BCF0
    DeviceLockTamperingSensitivity wdz();  // RVA: 0x67BD00
    void wea(DeviceLockTamperingSensitivity a);  // RVA: 0x67BD10
    void .ctor(DeviceLockLevel a, DeviceLockTamperingSensitivity b);  // RVA: 0x67BCB0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockTamperingSensitivity
    {
    public:
        // Static fields
        // static DeviceLockTamperingSensitivity Disabled;
        // static DeviceLockTamperingSensitivity Low;
        // static DeviceLockTamperingSensitivity Normal;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class DeviceUniqueIdentifierException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x66DD90
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class PersistentDataPathException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x66E9A0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbh
{
public:
    // Static fields
    // static Il2CppString* bmqu;
    // static Il2CppString* bmqv;
    // static dbf* bmqw;

    uint8_t pad_0000[0x10]; // 0x0000
    Action* bmqx; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Action* bmqy; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbr* <bmqz>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* <bmra>k__BackingField; // 0x0028

    // Methods
    void lxd(Stream* a);  // RVA: 0x67DA30
    void .ctor(Il2CppString* a, dbr* b);  // RVA: 0x67BFA0
    ObscuredFileHeader huq(Stream* a);  // RVA: 0x67D6B0
    void web(Action* a);  // RVA: 0x680740
    dbr* wef();  // RVA: 0x63C8B0
    ObscuredFileReadResult dfc();  // RVA: 0x67C000
    Il2CppString* wer(Il2CppString* a);  // RVA: 0x681CE0
    void wee(Action* a);  // RVA: 0x680920
    ObscuredFileWriteResult wek(Byte[][] a);  // RVA: 0x67DA00
    ObscuredFileHeader wen(Stream* a);  // RVA: 0x67D6B0
    Il2CppString* msk(Il2CppString* a);  // RVA: 0x67F380
    void wec(Action* a);  // RVA: 0x6807E0
    ObscuredFileReadResult wel();  // RVA: 0x67C000
    ObscuredFileWriteResult weo(Byte[][] a);  // RVA: 0x6816E0
    ObscuredFileReadResult otl();  // RVA: 0x67FAD0
    ObscuredFileHeader isc(Stream* a);  // RVA: 0x67D6B0
    void .ctor(Il2CppString* a);  // RVA: 0x67BE40
    void hqu();  // RVA: 0x67D680
    void .ctor(dbs* a);  // RVA: 0x67BDA0
    Il2CppString* hku(Il2CppString* a);  // RVA: 0x67D400
    void jfj();  // RVA: 0x67D680
    static void .cctor();  // RVA: 0x67BD20
    ObscuredFileReadResult erk();  // RVA: 0x67C040
    ObscuredFileWriteResult jsr(Byte[][] a);  // RVA: 0x67DA00
    void weq(Stream* a, DeviceLockLevel b);  // RVA: 0x681C50
    ObscuredFileHeader kny(Stream* a);  // RVA: 0x67D6B0
    Il2CppString* jen(Il2CppString* a);  // RVA: 0x67D710
    ObscuredFileReadResult mea();  // RVA: 0x67C000
    void wed(Action* a);  // RVA: 0x680880
    ObscuredFileWriteResult nsg(Byte[][] a);  // RVA: 0x67F5D0
    ObscuredFileReadResult mgq();  // RVA: 0x67DAA0
    void wej();  // RVA: 0x67D680
    bool weg();  // RVA: 0x6809C0
    void .ctor();  // RVA: 0x67BEE0
    void wep(Stream* a);  // RVA: 0x681BE0
    static void wei(Il2CppString* a);  // RVA: 0x6809E0
    ObscuredFileWriteResult ftn(Byte[][] a);  // RVA: 0x67CCB0
    ObscuredFileReadResult mod();  // RVA: 0x67E710
    ObscuredFileHeader ngq(Stream* a);  // RVA: 0x67D6B0
    Il2CppString* weh();  // RVA: 0x6809D0
    ObscuredFileReadResult wem();  // RVA: 0x680A70
    Il2CppString* hfk(Il2CppString* a);  // RVA: 0x67D1B0
    void jpm(Stream* a);  // RVA: 0x67D990
    void hvi();  // RVA: 0x67D680
};

// Namespace: <global>
class dbi
{
public:
    // Static fields
    // static int32_t bmrb;
    // static int32_t bmrc;
    // static Byte[][] bmrd;


    // Methods
    static void wes(Stream* a, Stream* b, dbq* c);  // RVA: 0x682320
    static void hxv(Stream* a, Stream* b, dbq* c);  // RVA: 0x682240
    static uint32_t weu(Stream* a);  // RVA: 0x6820A0
    static uint32_t hyp(Stream* a);  // RVA: 0x6820A0
    static uint32_t mjx(Byte[][] a);  // RVA: 0x682300
    static uint32_t che(Stream* a);  // RVA: 0x682010
    static uint32_t cwi(Stream* a);  // RVA: 0x6820A0
    static void gfa(Stream* a, Stream* b, dbq* c);  // RVA: 0x682170
    static uint32_t gby(Stream* a);  // RVA: 0x6820A0
    static void nio(Stream* a, Stream* b, dbq* c);  // RVA: 0x682320
    static void wet(Stream* a, Stream* b, dbq* c);  // RVA: 0x682240
    static void wfa(Stream* a, Stream* b, dbq* c);  // RVA: 0x682560
    static void cco(Stream* a, Stream* b, dbq* c);  // RVA: 0x681F60
    static void wey(Stream* a, Stream* b, dbq* c);  // RVA: 0x682320
    static uint32_t ehq(Stream* a);  // RVA: 0x6820E0
    static uint32_t obr(Stream* a);  // RVA: 0x6820A0
    static uint32_t hcw(Byte[][] a);  // RVA: 0x682220
    static uint32_t wex(Stream* a);  // RVA: 0x6820A0
    static uint32_t wev(Stream* a);  // RVA: 0x6823D0
    static void wew(Stream* a, uint32_t b);  // RVA: 0x682460
    static uint32_t wez(Byte[][] a);  // RVA: 0x682540
    static void ibk(Stream* a, Stream* b, dbq* c);  // RVA: 0x682240
    static void lwg(Stream* a, Stream* b, dbq* c);  // RVA: 0x682250
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileHeader
    {
    public:
        // Static fields
        // static uint8_t HeaderByte1;
        // static uint8_t HeaderByte2;
        // static uint8_t HeaderByte3;
        // static uint8_t HeaderByte4;
        // static uint8_t HeaderVersion;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t <Byte1>k__BackingField; // 0x0010
        uint8_t <Byte2>k__BackingField; // 0x0011
        uint8_t <Byte3>k__BackingField; // 0x0012
        uint8_t <Byte4>k__BackingField; // 0x0013
        uint8_t <Version>k__BackingField; // 0x0014
        ObscurationMode <ObscurationMode>k__BackingField; // 0x0015
    
        // Methods
        uint8_t get_Byte1();  // RVA: 0x66E000
        void set_Byte1(uint8_t value);  // RVA: 0x66E0A0
        uint8_t get_Byte2();  // RVA: 0x66E050
        void set_Byte2(uint8_t value);  // RVA: 0x66E0B0
        uint8_t get_Byte3();  // RVA: 0x66E060
        void set_Byte3(uint8_t value);  // RVA: 0x66E0C0
        uint8_t get_Byte4();  // RVA: 0x66E070
        void set_Byte4(uint8_t value);  // RVA: 0x66E0D0
        uint8_t get_Version();  // RVA: 0x66E090
        void set_Version(uint8_t value);  // RVA: 0x66E0F0
        ObscurationMode get_ObscurationMode();  // RVA: 0x66E080
        void set_ObscurationMode(ObscurationMode value);  // RVA: 0x66E0E0
        bool IsValid();  // RVA: 0x66E020
        void wfb(Stream* a);  // RVA: 0x66E100
        static void wfc(Stream* a, ObscurationMode b);  // RVA: 0x66E1C0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileErrorCode
    {
    public:
        // Static fields
        // static ObscuredFileErrorCode NoError;
        // static ObscuredFileErrorCode FileNotFound;
        // static ObscuredFileErrorCode FileDamaged;
        // static ObscuredFileErrorCode DataIsNotLocked;
        // static ObscuredFileErrorCode NotInitialized;
        // static ObscuredFileErrorCode OtherException;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileError
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileErrorCode <ErrorCode>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Exception* <Exception>k__BackingField; // 0x0018
    
        // Methods
        ObscuredFileErrorCode get_ErrorCode();  // RVA: 0x66E000
        Exception* get_Exception();  // RVA: 0x66E010
        void .ctor(ObscuredFileErrorCode code);  // RVA: 0x66DFE0
        void .ctor(Exception* exception);  // RVA: 0x66DFD0
        Il2CppString* ToString();  // RVA: 0x66DEF0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileReadResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Byte[][] <Data>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        bool <DataIsNotGenuine>k__BackingField; // 0x0018
        bool <DataFromAnotherDevice>k__BackingField; // 0x0019
        uint8_t pad_001A[0x6]; // 0x001A
        ObscuredFileError <Error>k__BackingField; // 0x0020
        uint8_t pad_0021[0xF]; // 0x0021
        bool <IsValid>k__BackingField; // 0x0030
    
        // Methods
        bool wfd();  // RVA: 0x66E5E0
        Byte[][] get_Data();  // RVA: 0x66E5B0
        bool wfe();  // RVA: 0x66E610
        bool get_DataIsNotGenuine();  // RVA: 0x66E5A0
        bool get_DataFromAnotherDevice();  // RVA: 0x66E590
        ObscuredFileError get_Error();  // RVA: 0x66E5C0
        bool get_IsValid();  // RVA: 0x66E5D0
        void .ctor(Byte[][] data, bool dataIsNotGenuine, bool dataFromAnotherDevice);  // RVA: 0x66E540
        void .ctor(ObscuredFileError error);  // RVA: 0x66E4F0
        static ObscuredFileReadResult wff(Exception* a);  // RVA: 0x66E620
        static ObscuredFileReadResult wfg(ObscuredFileErrorCode a);  // RVA: 0x66E6A0
        Il2CppString* ToString();  // RVA: 0x66E280
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileWriteResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileError <Error>k__BackingField; // 0x0010
        uint8_t pad_0011[0xF]; // 0x0011
        bool <IsValid>k__BackingField; // 0x0020
    
        // Methods
        bool wfh();  // RVA: 0x66E8C0
        ObscuredFileError get_Error();  // RVA: 0x66E8A0
        bool get_IsValid();  // RVA: 0x66E8B0
        void .ctor(ObscuredFileErrorCode result);  // RVA: 0x66E850
        void .ctor(ObscuredFileError error);  // RVA: 0x66E820
        static ObscuredFileWriteResult wfi(Exception* a);  // RVA: 0x66E8D0
        static ObscuredFileWriteResult wfj(ObscuredFileErrorCode a);  // RVA: 0x66E920
        Il2CppString* ToString();  // RVA: 0x66E720
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbj
{
public:
    // Static fields
    // static Il2CppString* bmre;
    // static Il2CppString* bmrf;
    // static Action* bmrg;
    // static Action* bmrh;
    // static dbh* bmri;
    // static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> bmrj;
    // static Il2CppObject* bmrk;
    // static bool <bmrl>k__BackingField;
    // static bool <bmrm>k__BackingField;
    // static bool <bmrn>k__BackingField;
    // static ObscuredFileReadResult <bmro>k__BackingField;
    // static ObscuredFileWriteResult <bmrp>k__BackingField;
    // static dbm* <bmrq>k__BackingField;


    // Methods
    static ObscuredBigInteger ivm(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x685C40
    static void wfy(Il2CppString* a, ObscuredShort b);  // RVA: 0x689880
    static dbh* kep(Il2CppString* a, dbr* b);  // RVA: 0x686530
    static ObscuredULong wgy(Il2CppString* a, ObscuredULong b);  // RVA: 0x68AAF0
    static void wik(Il2CppString* a, a b);  // RVA: 0x563E10
    static void wfp(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6892F0
    static void cil();  // RVA: 0x683230
    static Il2CppString* whr();  // RVA: 0x68B700
    static void gxn(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6851B0
    static ObscuredDecimal wgm(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x68A170
    static void mzv();  // RVA: 0x687F90
    static void bmu();  // RVA: 0x682B80
    static ObscuredChar nkr(Il2CppString* a, ObscuredChar b);  // RVA: 0x688280
    static void wfx(Il2CppString* a, ObscuredSByte b);  // RVA: 0x689800
    static ObscuredFileWriteResult myf(Byte[][] a);  // RVA: 0x687D70
    static void wge(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x689BD0
    static ObscuredBool wgh(Il2CppString* a, ObscuredBool b);  // RVA: 0x689DC0
    static void wga(Il2CppString* a, ObscuredUInt b);  // RVA: 0x689990
    static void wfk(Il2CppString* a, ObscuredBool b);  // RVA: 0x689010
    static void wfq(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6893A0
    static void fph(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6842E0
    static void gld();  // RVA: 0x684DD0
    static void wfm(Il2CppString* a, ObscuredChar b);  // RVA: 0x689120
    static void fri(bool a);  // RVA: 0x684390
    static void wfr(Il2CppString* a, ObscuredDouble b);  // RVA: 0x689450
    static void miz(Il2CppString* a, ObscuredByte b);  // RVA: 0x687790
    static void jhw();  // RVA: 0x685EA0
    static void wgg(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x689D10
    static void wft(Il2CppString* a, ObscuredGuid b);  // RVA: 0x689590
    static void wgf(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x689C60
    static b wil(Il2CppString* a, b b);  // RVA: 0x563E10
    static ObscuredFileWriteResult xw(Byte[][] a);  // RVA: 0x68D680
    static void nre();  // RVA: 0x6883F0
    static void kmg(Il2CppString* a, ObscuredInt b);  // RVA: 0x6866E0
    static ObscuredLong wgs(Il2CppString* a, ObscuredLong b);  // RVA: 0x68A6C0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wip();  // RVA: 0x68CC90
    static dbr* whi();  // RVA: 0x68B3E0
    static bool Save();  // RVA: 0x682660
    static void ly(Il2CppString* a, ObscuredULong b);  // RVA: 0x687220
    static ObscuredDateTime gel(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x684AA0
    static void nr(Il2CppString* a, ObscuredGuid b);  // RVA: 0x688340
    static ObscuredBool drv(Il2CppString* a, ObscuredBool b);  // RVA: 0x683820
    static void gjp(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x684D20
    static ObscuredVector2Int whb(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x68AD40
    static ObscuredChar wgj(Il2CppString* a, ObscuredChar b);  // RVA: 0x689F00
    static ObscuredDouble ilv(Il2CppString* a, ObscuredDouble b);  // RVA: 0x685790
    static ObscuredFileWriteResult ceo();  // RVA: 0x683040
    static ObscuredFileWriteResult wiu(Byte[][] a);  // RVA: 0x68D460
    static bool whj();  // RVA: 0x68B430
    static void whh(Action* a);  // RVA: 0x68B2E0
    static void kke(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x686650
    static void wic(Il2CppString* a, dbr* b, bool c);  // RVA: 0x68BD00
    static void wfw(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x689750
    static bool whl();  // RVA: 0x68B4E0
    static bool whm();  // RVA: 0x68B540
    static c wir(Il2CppString* a, c b);  // RVA: 0x563E10
    static void whk(bool a);  // RVA: 0x68B480
    static ObscuredBigInteger itw(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x685B40
    static void whq(bool a);  // RVA: 0x68B6A0
    static void wis(Il2CppString* a, d b);  // RVA: 0x563E10
    static ObscuredFileReadResult whs();  // RVA: 0x68B750
    static ObscuredVector3 whc(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68AE00
    static void wfv(Il2CppString* a, ObscuredLong b);  // RVA: 0x6896C0
    static void ieu(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6856E0
    static void ebw(Il2CppString* a, ObscuredFloat b);  // RVA: 0x683AA0
    static void whz(bool a);  // RVA: 0x68BB10
    static ObscuredVector3Int ocj(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x688520
    static ObscuredUInt iok(Il2CppString* a, ObscuredUInt b);  // RVA: 0x685870
    static void wfn(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x6891B0
    static void hig(Il2CppString* a, ObscuredULong b);  // RVA: 0x685260
    static ObscuredBigInteger wgn(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68A270
    static void jsp(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6862D0
    static ObscuredVector2 wha(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68AC70
    static void kve(Il2CppString* a, ObscuredDouble b);  // RVA: 0x6868C0
    static void byw(Il2CppString* a, ObscuredFloat b);  // RVA: 0x682F10
    static ObscuredVector3 mfe(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x687610
    static bool wig(Il2CppString* a);  // RVA: 0x68C650
    static void wij();  // RVA: 0x68C8A0
    static void iot(Il2CppString* a, ObscuredDouble b);  // RVA: 0x685920
    static void mit(Il2CppString* a, ObscuredSByte b);  // RVA: 0x687710
    static void may(Il2CppString* a, ObscuredInt b);  // RVA: 0x687470
    static ObscuredFileWriteResult hod();  // RVA: 0x6853F0
    static void end(Il2CppString* a, ObscuredDouble b);  // RVA: 0x683FD0
    static ObscuredVector3Int whd(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68AF00
    static void bx();  // RVA: 0x682EA0
    static ObscuredFileWriteResult wiq();  // RVA: 0x68D090
    static void wfz(Il2CppString* a, ObscuredString* b);  // RVA: 0x689910
    static void wie();  // RVA: 0x68C240
    static void whx(dbm* a);  // RVA: 0x68B990
    static ObscuredDateTimeOffset wgl(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68A080
    static ObscuredUInt lel(Il2CppString* a, ObscuredUInt b);  // RVA: 0x686A80
    static void krr(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x686810
    static void erk(Il2CppString* a, ObscuredByte b);  // RVA: 0x684070
    static ObscuredVector2Int dat(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x683590
    static ObscuredInt jow(Il2CppString* a, ObscuredInt b);  // RVA: 0x686140
    static void ies(Il2CppString* a, ObscuredInt b);  // RVA: 0x685660
    static void po(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x688EC0
    static ObscuredDecimal hnz(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6852F0
    static void gan(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x6849F0
    static dbm* whw();  // RVA: 0x68B940
    static void dz(Il2CppString* a, ObscuredChar b);  // RVA: 0x683980
    static ObscuredBool pu(Il2CppString* a, ObscuredBool b);  // RVA: 0x688F50
    static ObscuredDateTime wgk(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x689FC0
    static void eho(Il2CppString* a, bool b);  // RVA: 0x683C30
    static ObscuredByte jzg(Il2CppString* a, ObscuredByte b);  // RVA: 0x686420
    static void who(bool a);  // RVA: 0x68B5F0
    static void wid();  // RVA: 0x68C080
    static dbh* ejs(Il2CppString* a, dbr* b);  // RVA: 0x683EB0
    static void okg(Il2CppString* a, ObscuredGuid b);  // RVA: 0x688850
    static void okx(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x6889B0
    static void whg(Action* a);  // RVA: 0x68B1E0
    static void oro(Il2CppString* a, ObscuredGuid b);  // RVA: 0x688E10
    static void wia(Il2CppString* a, bool b);  // RVA: 0x68BBD0
    static void jfq(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x685D40
    static ObscuredInt wgr(Il2CppString* a, ObscuredInt b);  // RVA: 0x68A610
    static bool etq(Il2CppString* a);  // RVA: 0x6840F0
    static System.Collections.Generic.ICollection<System.String> ctk();  // RVA: 0x683320
    static void jim(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x686090
    static ObscuredUInt wgx(Il2CppString* a, ObscuredUInt b);  // RVA: 0x68AA40
    static void lwf();  // RVA: 0x687030
    static void oke();  // RVA: 0x6887E0
    static bool mqy();  // RVA: 0x687910
    static System.Collections.Generic.ICollection<System.String> lyp();  // RVA: 0x6872B0
    static void wfo(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x689240
    static ObscuredUInt okr(Il2CppString* a, ObscuredUInt b);  // RVA: 0x688900
    static ObscuredFileReadResult wit();  // RVA: 0x68D280
    static void wif(bool a);  // RVA: 0x68C570
    static void jyq(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x686370
    static dbh* why();  // RVA: 0x68BA00
    static void dgw(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x6836E0
    static void lyr(Il2CppString* a, ObscuredByte b);  // RVA: 0x687330
    static ObscuredUShort wgz(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68ABB0
    static ObscuredString* wgw(Il2CppString* a, ObscuredString* b);  // RVA: 0x68A9C0
    static ObscuredGuid mml(Il2CppString* a, ObscuredGuid b);  // RVA: 0x687810
    static void oqu(Il2CppString* a, ObscuredSByte b);  // RVA: 0x688D90
    static ObscuredVector2 iqe(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x6859C0
    static ObscuredVector2Int nsj(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x688460
    static void hxf(Il2CppString* a, ObscuredString* b);  // RVA: 0x6855E0
    static void win();  // RVA: 0x68CBB0
    static void dsq(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6838E0
    static ObscuredDouble wgo(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68A370
    static bool whp();  // RVA: 0x68B650
    static void ccx(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x682FB0
    static void wii(Il2CppString* a);  // RVA: 0x68C750
    static ObscuredDecimal gnb(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x684E40
    static void wgc(Il2CppString* a, ObscuredUShort b);  // RVA: 0x689AA0
    static ObscuredDecimal fuu(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x684550
    static void wgd(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x689B30
    static ObscuredSByte wgu(Il2CppString* a, ObscuredSByte b);  // RVA: 0x68A880
    static void dfm(Il2CppString* a, ObscuredULong b);  // RVA: 0x683650
    static ObscuredDouble jqo(Il2CppString* a, ObscuredDouble b);  // RVA: 0x6861F0
    static void gwt(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x684F40
    static void kqi(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x686760
    static void wgb(Il2CppString* a, ObscuredULong b);  // RVA: 0x689A10
    static ObscuredShort ock(Il2CppString* a, ObscuredShort b);  // RVA: 0x688620
    static void kbx(Il2CppString* a, ObscuredLong b);  // RVA: 0x6864A0
    static ObscuredUInt dpg(Il2CppString* a, ObscuredUInt b);  // RVA: 0x683770
    static ObscuredInt iqh(Il2CppString* a, ObscuredInt b);  // RVA: 0x685A90
    static ObscuredLong gih(Il2CppString* a, ObscuredLong b);  // RVA: 0x684C60
    static dbh* mev(Il2CppString* a, dbr* b);  // RVA: 0x6874F0
    static ObscuredQuaternion fvs(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x684650
    static void fbk(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x684170
    static ObscuredVector3Int nby(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x688180
    static dbh* ldv(Il2CppString* a, dbr* b);  // RVA: 0x686960
    static ObscuredDateTimeOffset efr(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x683B40
    static void jgs(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x685DF0
    static ObscuredFileWriteResult whu();  // RVA: 0x68B850
    static ObscuredVector2Int lzq(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6873B0
    static void whv(ObscuredFileWriteResult a);  // RVA: 0x68B8C0
    static ObscuredVector2Int brb(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x682C70
    static System.Collections.Generic.ICollection<System.String> wih();  // RVA: 0x68C6D0
    static ObscuredFileReadResult gxc();  // RVA: 0x684FD0
    static ObscuredByte wgi(Il2CppString* a, ObscuredByte b);  // RVA: 0x689E80
    static void buu(Il2CppString* a, ObscuredByte b);  // RVA: 0x682D30
    static ObscuredVector3Int gfv(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x684B60
    static ObscuredQuaternion wgt(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68A780
    static ObscuredGuid ocx(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6886E0
    static void whf(Action* a);  // RVA: 0x68B0F0
    static void wfs(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6894F0
    static void whe(Action* a);  // RVA: 0x68B000
    static void wfl(Il2CppString* a, ObscuredByte b);  // RVA: 0x6890A0
    static ObscuredShort wgv(Il2CppString* a, ObscuredShort b);  // RVA: 0x68A900
    static ObscuredFloat mse(Il2CppString* a, ObscuredFloat b);  // RVA: 0x687CB0
    static void fh(bool a);  // RVA: 0x684220
    static ObscuredFileWriteResult eih();  // RVA: 0x683CC0
    static void cuv();  // RVA: 0x6833A0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> lif();  // RVA: 0x686B30
    static void wio();  // RVA: 0x68CC20
    static void clz(Il2CppString* a, ObscuredSByte b);  // RVA: 0x6832A0
    static void wib(dbr* a, bool b);  // RVA: 0x68BC60
    static void .cctor();  // RVA: 0x682A00
    static void eao(Il2CppString* a, ObscuredChar b);  // RVA: 0x683A10
    static ObscuredBool zr(Il2CppString* a, ObscuredBool b);  // RVA: 0x68D8A0
    static ObscuredDateTimeOffset bvu(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x682DB0
    static void wfu(Il2CppString* a, ObscuredInt b);  // RVA: 0x689640
    static ObscuredInt fzf(Il2CppString* a, ObscuredInt b);  // RVA: 0x684940
    static void okz();  // RVA: 0x688A60
    static ObscuredGuid wgq(Il2CppString* a, ObscuredGuid b);  // RVA: 0x68A510
    static ObscuredFloat wgp(Il2CppString* a, ObscuredFloat b);  // RVA: 0x68A450
    static ObscuredGuid lrw(Il2CppString* a, ObscuredGuid b);  // RVA: 0x686F30
    static ObscuredQuaternion bc(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x682A80
    static dbh* wim(Il2CppString* a, dbr* b);  // RVA: 0x68CA90
    static ObscuredFileWriteResult fxk();  // RVA: 0x684750
    static bool bpq(Il2CppString* a);  // RVA: 0x682BF0
    static bool whn();  // RVA: 0x68B5A0
    static ObscuredVector3 fuf(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x684450
    static void wht(ObscuredFileReadResult a);  // RVA: 0x68B7C0
};

// Namespace: <global>
class dbk
{
public:
    // Static fields
    // static bool bmrr;


    // Methods
    static void don(bool a);  // RVA: 0x68DBF0
    static void wiy(bool a);  // RVA: 0x68DF60
    static void wix(bool a);  // RVA: 0x68DF50
    static void wiz(bool a);  // RVA: 0x68DF70
    static bool wiw();  // RVA: 0x68DBD0
    static void wja();  // RVA: 0x68E060
    static bool cly();  // RVA: 0x68DBD0
    static bool glc();  // RVA: 0x68DBD0
    static void bjv();  // RVA: 0x68D960
    static void wiv();  // RVA: 0x68DCE0
};

// Namespace: <global>
class dbl
{
public:

    // Methods
    static Byte[][] jvx(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x68E260
    static Byte[][] krq(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x68E2D0
    static Byte[][] wjd(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x68E3B0
    static ObscuredPrefsData wjb(a a, dbm* b);  // RVA: 0x563E10
    static dbo* wjf(dbm* a);  // RVA: 0x68E1C0
    static dbo* gij(dbm* a);  // RVA: 0x68E1C0
    static dbo* jfu(dbm* a);  // RVA: 0x68E1C0
    static dbo* cxk(dbm* a);  // RVA: 0x68E1C0
    static Byte[][] fwc(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x68E1F0
    static b wjc(ObscuredPrefsData a, dbm* b);  // RVA: 0x563E10
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wje(Byte[][] a, dbm* b);  // RVA: 0x68E420
    static Byte[][] kts(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x68E340
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ACTkSerializationKind
    {
    public:
        // Static fields
        // static ACTkSerializationKind Binary;
    
        uint8_t pad_0000[0x10]; // 0x0000
        int32_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbm
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ACTkSerializationKind <bmrs>k__BackingField; // 0x0010

    // Methods
    ACTkSerializationKind wjg();  // RVA: 0x66DB40
    void .ctor(ACTkSerializationKind a);  // RVA: 0x67B210
};

// Namespace: <global>
class dbn
{
public:
    // Static fields
    // static uint8_t bmrt;
    // static dbn* bmru;


    // Methods
    Byte[][] wjk(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x68E750
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjl(Byte[][] a);  // RVA: 0x68EB40
    static dbo* wjh();  // RVA: 0x68E6C0
    b wjj(ObscuredPrefsData a);  // RVA: 0x563E10
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjn(BinaryReader* a);  // RVA: 0x68EF50
    static dbo* jn();  // RVA: 0x68E630
    void wjm(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x68E590
    ObscuredPrefsData wji(a a);  // RVA: 0x563E10
    void .ctor();  // RVA: 0x628380
    void omo(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x68E590
    void org(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x68E590
    static dbo* dwh();  // RVA: 0x68E500
    void not(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x68E590
    void izl(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x68E590
};

// Namespace: <global>
class dbo
{
public:

    // Methods
    ObscuredPrefsData wji(a a);  // RVA: 0x563E10
    b wjj(ObscuredPrefsData a);  // RVA: 0x563E10
    Byte[][] wjk(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x419570
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjl(Byte[][] a);  // RVA: 0x419570
};

// Namespace: <global>
class dbp
{
public:
    // Static fields
    // static dbp* bmrv;


    // Methods
    Byte[][] wjk(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x68F210
    void .ctor();  // RVA: 0x628380
    static dbo* wjo();  // RVA: 0x68F290
    ObscuredPrefsData wji(a a);  // RVA: 0x563E10
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjl(Byte[][] a);  // RVA: 0x68F250
    static dbo* oci();  // RVA: 0x68F180
    static dbo* lnj();  // RVA: 0x68F0F0
    static dbo* hze();  // RVA: 0x68F060
    b wjj(ObscuredPrefsData a);  // RVA: 0x563E10
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscurationMode
    {
    public:
        // Static fields
        // static ObscurationMode Plain;
        // static ObscurationMode Encrypted;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbq
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ObscurationMode <bmrw>k__BackingField; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] <bmrx>k__BackingField; // 0x0018

    // Methods
    ObscurationMode wjp();  // RVA: 0x66E8B0
    Byte[][] wjq();  // RVA: 0x68F440
    void .ctor(Il2CppString* a);  // RVA: 0x68F320
    void .ctor(Byte[][] a);  // RVA: 0x68F3F0
};

// Namespace: <global>
class dbr
{
public:

    // Methods
    ObscuredFileLocation wjr();  // RVA: 0x421380
    dbq* wjs();  // RVA: 0x41C380
    dbg* wjt();  // RVA: 0x41C380
    bool wju();  // RVA: 0x421380
    bool wjv();  // RVA: 0x421380
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileLocation
    {
    public:
        // Static fields
        // static ObscuredFileLocation PersistentData;
        // static ObscuredFileLocation Custom;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbs
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ObscuredFileLocation <bmry>k__BackingField; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    dbq* <bmrz>k__BackingField; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbg* <bmsa>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bool <bmsb>k__BackingField; // 0x0028
    bool <bmsc>k__BackingField; // 0x0029

    // Methods
    ObscuredFileLocation wjr();  // RVA: 0x66E8B0
    void wjw(ObscuredFileLocation a);  // RVA: 0x67BCF0
    dbq* wjs();  // RVA: 0x68F440
    void wjx(dbq* a);  // RVA: 0x67B580
    dbg* wjt();  // RVA: 0x63C8B0
    void wjy(dbg* a);  // RVA: 0x63C8C0
    bool wju();  // RVA: 0x63C8D0
    void wjz(bool a);  // RVA: 0x63C8E0
    bool wjv();  // RVA: 0x68F730
    void wka(bool a);  // RVA: 0x68F740
    void .ctor();  // RVA: 0x68F450
    void .ctor(ObscuredFileLocation a);  // RVA: 0x68F650
    void .ctor(dbg* a);  // RVA: 0x68F5A0
