// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class b : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Unit* OwnerUnit; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Animator* Animatior; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    EUNITSTATE bawk; // 0x0030

    // Methods
    void Awake();  // RVA: 0x7FF4A0
    void mna(Il2CppString* a);  // RVA: 0x7FF580
    void dtn(float a);  // RVA: 0x7FF560
    void Update();  // RVA: 0x632CB0
    void .ctor();  // RVA: 0x628650
    void dtm(EUNITSTATE a);  // RVA: 0x4177F0
    void jan(float a);  // RVA: 0x7FF560
    void dto(Il2CppString* a);  // RVA: 0x7FF580
    void lyv(Il2CppString* a);  // RVA: 0x7FF580
    void kuj(Il2CppString* a);  // RVA: 0x7FF580
    void eat(Il2CppString* a);  // RVA: 0x7FF580
    void jsg(float a);  // RVA: 0x7FF560
};

// Namespace: <global>
class c : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Action* OnACTIVE; // 0x0020

    // Methods
    void jns(Action* a);  // RVA: 0x8068A0
    void .ctor();  // RVA: 0x628650
    void hou();  // RVA: 0x806880
    void lx();  // RVA: 0x806880
    void kub(Action* a);  // RVA: 0x806940
    void kwe(Action* a);  // RVA: 0x8069E0
    void jrx();  // RVA: 0x806880
    void dtp(Action* a);  // RVA: 0x8067E0
    void dtq();  // RVA: 0x806880
    void lnq();  // RVA: 0x806880
};

// Namespace: <global>
class g
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawl; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawm; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    FlickerController* bawn; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bawo; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67B210
    void dtr();  // RVA: 0x632CB0
    bool MoveNext();  // RVA: 0x806A80
    Il2CppObject* dts();  // RVA: 0x68F440
    void dtt();  // RVA: 0x806BC0
    Il2CppObject* dtu();  // RVA: 0x68F440
};

// Namespace: <global>
class FlickerController : public MonoBehaviour
{
public:
    // Static fields
    // static MaterialPropertyBlock* bawp;
    // static int32_t bawq;

    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* m_spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float m_targetValue; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float m_flickTime; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    Coroutine* bawr; // 0x0030

    // Methods
    void Awake();  // RVA: 0x7F4A10
    void dtv();  // RVA: 0x7F4B50
    void dtw();  // RVA: 0x7F4BF0
    IEnumerator* dtx();  // RVA: 0x7F4C40
    void dty(float a);  // RVA: 0x7F4CB0
    void .ctor();  // RVA: 0x628650
    static void .cctor();  // RVA: 0x7F4AE0
};

// Namespace: <global>
class h : public MonoBehaviour
{
public:

    // Methods
    void mis();  // RVA: 0x632CB0
    void Update();  // RVA: 0x632CB0
    void .ctor();  // RVA: 0x628650
    void ifm();  // RVA: 0x632CB0
    void Start();  // RVA: 0x632CB0
    void kyy();  // RVA: 0x632CB0
    void eft();  // RVA: 0x632CB0
    void orq();  // RVA: 0x632CB0
};

// Namespace: <global>
class k : public b
{
public:

    // Methods
    void Update();  // RVA: 0x806C00
    void dtm(EUNITSTATE a);  // RVA: 0x806CD0
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class m : public MonoBehaviour
{
public:

    // Methods
    void .ctor();  // RVA: 0x628650
    void hzo();  // RVA: 0x632CB0
    void kxz();  // RVA: 0x632CB0
    void Start();  // RVA: 0x632CB0
    void Update();  // RVA: 0x632CB0
};

// Namespace: <global>
class HpBar : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rect_m; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Slider* slider; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* image_Fillarea; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Unit* unit_Attach; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 monsterOffset; // 0x0040
    uint8_t pad_0041[0xB]; // 0x0041
    Vector3 heroOffset; // 0x004C
    uint8_t pad_004D[0xB]; // 0x004D
    Color color_Monster; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    Color color_Hero; // 0x0068

    // Methods
    void dtz(Unit* a);  // RVA: 0x7F6250
    void Update();  // RVA: 0x7F6150
    void dua();  // RVA: 0x7F6380
    void dub(float a);  // RVA: 0x7F64B0
    void duc();  // RVA: 0x7F6500
    void .ctor();  // RVA: 0x7F61A0
};

// Namespace: <global>
class n : public b
{
public:

    // Methods
    void dtm(EUNITSTATE a);  // RVA: 0x806E90
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
struct EUNITSTATE
{
public:
    // Static fields
    // static EUNITSTATE NONE;
    // static EUNITSTATE IDLE;
    // static EUNITSTATE MOVE;
    // static EUNITSTATE RETURN_TO_POSITION;
    // static EUNITSTATE ATTACK;
    // static EUNITSTATE REVIVE;
    // static EUNITSTATE DIE;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EATTACKSTATE
{
public:
    // Static fields
    // static EATTACKSTATE PREDELAY;
    // static EATTACKSTATE ACTIONTIME;
    // static EATTACKSTATE POSTDELAY;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct TextDisplayPosition
{
public:
    // Static fields
    // static TextDisplayPosition Center;
    // static TextDisplayPosition Top;
    // static TextDisplayPosition Bottom;
    // static TextDisplayPosition TopOffset;
    // static TextDisplayPosition CenterUp;
    // static TextDisplayPosition CenterDown;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class o
{
public:
    // Static fields
    // static intptr_t baws;
    // static int32_t bawt;
    // static int32_t bawu;


    // Methods
    static uint32_t GetModuleFileName(intptr_t hModule, StringBuilder* lpFilename, int32_t nSize);  // RVA: 0x806FD0
    static void .cctor();  // RVA: 0x807380
    static int32_t RegSetValueEx(intptr_t hKey, Il2CppString* lpValueName, int32_t Reserved, int32_t dwType, Il2CppString* lpData, int32_t cbData);  // RVA: 0x807290
    static int32_t RegOpenKeyEx(intptr_t hKey, Il2CppString* lpSubKey, int32_t ulOptions, int32_t samDesired, intptr_t phkResult);  // RVA: 0x8071C0
    static void osa(Il2CppString* a, bool b);  // RVA: 0x807B60
    static void dud(Il2CppString* a, bool b);  // RVA: 0x8073E0
    void .ctor();  // RVA: 0x628380
    static void gmi(Il2CppString* a, bool b);  // RVA: 0x8077A0
    static int32_t RegCloseKey(intptr_t hKey);  // RVA: 0x8070A0
    static int32_t RegDeleteValue(intptr_t hKey, Il2CppString* lpValueName);  // RVA: 0x807120
};

// Namespace: <global>
class MonitorEnumDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x7F6F30
    bool Invoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData);  // RVA: 0x7F6F10
    IAsyncResult* BeginInvoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x7F6E30
    bool EndInvoke(IAsyncResult* result);  // RVA: 0x7F6EE0
};

// Namespace: <global>
class p : public MonoBehaviour
{
public:
    // Static fields
    // static uint32_t bawv;
    // static int32_t baww;
    // static int32_t bawx;
    // static RECT bawy;


    // Methods
    void .ctor();  // RVA: 0x628650
    void iv(bool hasFocus);  // RVA: 0x808190
    static bool duf(intptr_t a, intptr_t b, intptr_t c, intptr_t d);  // RVA: 0x808380
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x808190
    void nhj(bool hasFocus);  // RVA: 0x808190
    void due();  // RVA: 0x8081A0
    void dug();  // RVA: 0x808590
    static bool EnumDisplayMonitors(intptr_t hdc, intptr_t lprcClip, MonitorEnumDelegate* lpfnEnum, intptr_t dwData);  // RVA: 0x807F20
    static bool GetWindowRect(intptr_t hwnd, RECT rect);  // RVA: 0x808070
    static bool GetMonitorInfo(intptr_t hMonitor, MONITORINFO lpmi);  // RVA: 0x807FE0
    void cqy(bool hasFocus);  // RVA: 0x808190
    void ixg();  // RVA: 0x808660
    void igr(bool hasFocus);  // RVA: 0x808190
    static intptr_t MonitorFromWindow(intptr_t hwnd, uint32_t dwFlags);  // RVA: 0x808100
};

// Namespace: <global>
class BoxEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_Image> animationLists; // 0x0020

    // Methods
    void duh(int32_t a);  // RVA: 0x7F3F70
    bool dui();  // RVA: 0x7F4170
    void OnDisable();  // RVA: 0x7F3E80
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class q : public MonoBehaviour
{
public:

    // Methods
    void OnPointerDown(PointerEventData* eventData);  // RVA: 0x632CB0
    void OnPointerUp(PointerEventData* eventData);  // RVA: 0x632CB0
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class ItemSlotDirectMovePreview : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* RectTransform; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Image* m_hoverTargetImage; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Sprite* m_moveToTradingStashIcon; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite* m_moveToCubeIcon; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite* m_moveToInventoryIcon; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Sprite* m_moveToStashIcon; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Sprite* m_moveToGearIcon; // 0x0050

    // Methods
    void duj(ESlotType a, ESlotType b);  // RVA: 0x7F6520
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
struct <DelayedAnimation>d__7
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroEffectController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FBC20
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FBC10
};

// Namespace: <global>
class SelectHeroEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_Image[][] effectObjects; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t targetFrame; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034

    // Methods
    void Awake();  // RVA: 0x7F70C0
    void OnDestroy();  // RVA: 0x7F71C0
    void duk(int32_t a);  // RVA: 0x7F7300
    UniTaskVoid dul();  // RVA: 0x7F73C0
    void dum();  // RVA: 0x7F7450
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
struct <DelayedAnimation>d__9
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroShakeFlashController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FBE80
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FBC10
};

// Namespace: <global>
class SelectHeroShakeFlashController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    int32_t targetFrame; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    SelectHeroOption* selectHeroOption; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    bool hasFlash; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Il2CppString* otherAnimKey; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool hasShake; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float delay; // 0x004C

    // Methods
    void Awake();  // RVA: 0x7F7690
    void OnDestroy();  // RVA: 0x7F7790
    UniTaskVoid dun();  // RVA: 0x7F7A30
    void Play(int32_t frame);  // RVA: 0x7F78D0
    void Play();  // RVA: 0x7F7990
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class r
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    SkillPointAnimationController* bawz; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    RectTransform* baxa; // 0x0018

    // Methods
    void duy();  // RVA: 0x808840
    void olb();  // RVA: 0x808840
    void duo();  // RVA: 0x808840
    void .ctor();  // RVA: 0x628380
    void mzu();  // RVA: 0x808840
};

// Namespace: <global>
class SkillPointAnimationController : public MonoBehaviour
{
public:
    // Static fields
    // static Color baxb;
    // static Color baxc;

    uint8_t pad_0000[0x20]; // 0x0000
    Image* m_sliderBarCover; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    GameObject* prefab; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Transform* poolHolder; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Transform[][] m_iconTargetPos; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_animDurationTime; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.Queue<UnityEngine.RectTransform> baxd; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    System.Collections.Generic.List<UnityEngine.RectTransform> baxe; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Tweener* baxf; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    ActiveSkillSlotDetail* baxg; // 0x0060

    // Methods
    void Awake();  // RVA: 0x7F7AC0
    void dup();  // RVA: 0x7F7E70
    void duq();  // RVA: 0x7F7F60
    void dur(bool a);  // RVA: 0x7F8180
    void dus();  // RVA: 0x7F83E0
    void dut();  // RVA: 0x7F8520
    void duu(Color a);  // RVA: 0x7F8660
    void duv(int32_t a, int32_t b);  // RVA: 0x7F8740
    RectTransform* duw();  // RVA: 0x7F8C70
    void dux(RectTransform* a);  // RVA: 0x7F8DB0
    void OnDisable();  // RVA: 0x7F7BF0
    void .ctor();  // RVA: 0x7F7DA0
    static void .cctor();  // RVA: 0x7F7D40
};

// Namespace: <global>
class ActSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    int32_t act; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* text_ActName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Button* btn; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    ToggleButton* button_toggle; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_selectedCorrectionY; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float m_unSelectedCorrectionY; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Color m_selectedColor; // 0x0048
    uint8_t pad_0049[0xF]; // 0x0049
    Color m_unSelectedColor; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    System.Action<System.Int32> baxh; // 0x0068

    // Methods
    void duy(int32_t a, System.Action<System.Int32> b);  // RVA: 0x7F12A0
    void duz();  // RVA: 0x7F1400
    void dva(bool a);  // RVA: 0x7F14E0
    void dvb();  // RVA: 0x7F15C0
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class u : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<TaskbarHero.UI.AttributeSlot> attributeSlots; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x8088F0
};

// Namespace: <global>
class LogSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rt; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* Text_LogText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Animator* animator; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    car* feedback1; // 0x0038

    // Methods
    void dvc(Il2CppString* a, Vector2 b, GradeSO* c);  // RVA: 0x7F6C60
    void offObject();  // RVA: 0x632CB0
    void dvd();  // RVA: 0x7F6DD0
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class ba : public MonoBehaviour
{
public:

    // Methods
    void gmk();  // RVA: 0x632CB0
    void dci();  // RVA: 0x632CB0
    void Update();  // RVA: 0x632CB0
    void jyb();  // RVA: 0x632CB0
    void bcu();  // RVA: 0x632CB0
    void Start();  // RVA: 0x632CB0
    void .ctor();  // RVA: 0x628650
    void dzj();  // RVA: 0x632CB0
};

// Namespace: <global>
class bb
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxi; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxj; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxk; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67B210
    void dve();  // RVA: 0x632CB0
    bool MoveNext();  // RVA: 0x7FF5A0
    Il2CppObject* dvf();  // RVA: 0x68F440
    void dvg();  // RVA: 0x7FF7C0
    Il2CppObject* dvh();  // RVA: 0x68F440
};

// Namespace: <global>
class bc
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxl; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxm; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxn; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxo; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float baxp; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float baxq; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float baxr; // 0x0034

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67B210
    void dvi();  // RVA: 0x632CB0
    bool MoveNext();  // RVA: 0x7FF800
    Il2CppObject* dvj();  // RVA: 0x68F440
    void dvk();  // RVA: 0x7FF940
    Il2CppObject* dvl();  // RVA: 0x68F440
};

// Namespace: <global>
class bd
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxs; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxt; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxu; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxv; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67B210
    void dvm();  // RVA: 0x632CB0
    bool MoveNext();  // RVA: 0x7FF980
    Il2CppObject* dvn();  // RVA: 0x68F440
    void dvo();  // RVA: 0x7FFA90
    Il2CppObject* dvp();  // RVA: 0x68F440
};

// Namespace: <global>
class BlinkAnimation : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float blinkSpeed; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float minAlpha; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float maxAlpha; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    bool smoothBlink; // 0x002C
    bool playOnStart; // 0x002D
    bool loop; // 0x002E
    bool unscaledTime; // 0x002F
    SpriteRenderer* baxw; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* baxx; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    CanvasGroup* baxy; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    TextMesh* baxz; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    MeshRenderer* baya; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* bayb; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    TextMeshPro* bayc; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    bool bayd; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Coroutine* baye; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float bayf; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnBlinkStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnBlinkEnd; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    Action* OnBlinkCycle; // 0x0090

    // Methods
    bool dvq();  // RVA: 0x7F16A0
    float dvr();  // RVA: 0x7F16B0
    void dvs(float a);  // RVA: 0x7F16C0
    float dvt();  // RVA: 0x7F16E0
    float dvu();  // RVA: 0x7F16F0
    void Awake();  // RVA: 0x7F15E0
    void Start();  // RVA: 0x7F1670
    void OnValidate();  // RVA: 0x7F1600
    void dvv();  // RVA: 0x7F1700
    void dvw();  // RVA: 0x7F19D0
    void dvx();  // RVA: 0x7F1C40
    void dvy();  // RVA: 0x7F1CF0
    void dvz();  // RVA: 0x7F1D40
    void dwa();  // RVA: 0x7F1E30
    void dwb(float a);  // RVA: 0x7F1E40
    float dwc();  // RVA: 0x7F2250
    void dwd(float a, float b, float c, bool d);  // RVA: 0x7F24C0
    IEnumerator* dwe();  // RVA: 0x7F2630
    IEnumerator* dwf(float a);  // RVA: 0x7F26A0
    IEnumerator* dwg(float a);  // RVA: 0x7F2720
    void dwh();  // RVA: 0x7F27A0
    void .ctor();  // RVA: 0x7F1680
};

// Namespace: <global>
struct SpriteAnimClip
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* ClipName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Sprite[][] Sprites; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool Loop; // 0x0020
};

// Namespace: <global>
class be
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayg; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayh; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_Image* bayi; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayj; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bayk; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67B210
    void dwi();  // RVA: 0x632CB0
    bool MoveNext();  // RVA: 0x7FFAD0
    Il2CppObject* dwj();  // RVA: 0x68F440
    void dwk();  // RVA: 0x7FFD10
    Il2CppObject* dwl();  // RVA: 0x68F440
};

// Namespace: <global>
class SpriteAnimation_Image : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Image* image; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float speed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool loop; // 0x003A
    bool unscaledTime; // 0x003B
    bool m_deactivateOnComplete; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    Coroutine* bayl; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool baym; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayn; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Action* OnAnimationStart; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Action* OnAnimationComplete; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    System.Action<System.Int32> OnFrameChanged; // 0x0060

    // Methods
    Image* dwm();  // RVA: 0x63C8B0
    System.Collections.Generic.List<UnityEngine.Sprite> dwn();  // RVA: 0x6809D0
    float dwo();  // RVA: 0x7F90D0
    float dwp();  // RVA: 0x7F90E0
    bool dwq();  // RVA: 0x7F90F0
    bool dwr();  // RVA: 0x7F9100
    int32_t dws();  // RVA: 0x7F9110
    int32_t dwt();  // RVA: 0x7F9120
    float dwu();  // RVA: 0x7F9160
    void Start();  // RVA: 0x7F8FE0
    void OnEnable();  // RVA: 0x7F8ED0
    void OnValidate();  // RVA: 0x7F8F30
    void dwv();  // RVA: 0x7F91B0
    void dww();  // RVA: 0x7F9390
    void dwx();  // RVA: 0x7F93E0
    void dwy(int32_t a);  // RVA: 0x7F9470
    void dwz();  // RVA: 0x7F9570
    void dxa();  // RVA: 0x7F95C0
    IEnumerator* dxb();  // RVA: 0x7F9620
    void dxc(float a, float b, bool c);  // RVA: 0x7F9690
    void dxd(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7F9730
    void dxe(Sprite* a);  // RVA: 0x7F98B0
    void dxf(int32_t a);  // RVA: 0x7F9940
    void dxg();  // RVA: 0x7F99D0
    void dxh();  // RVA: 0x632CB0
    void .ctor();  // RVA: 0x7F9040
};

// Namespace: <global>
class bf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayo; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayp; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_SpriteRenderer* bayq; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayr; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bays; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67B210
    void dxi();  // RVA: 0x632CB0
    bool MoveNext();  // RVA: 0x7FFD50
    Il2CppObject* dxj();  // RVA: 0x68F440
    void dxk();  // RVA: 0x800230
    Il2CppObject* dxl();  // RVA: 0x68F440
};

// Namespace: <global>
class SpriteAnimation_SpriteRenderer : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool DisableObjectWhenPlayEnd; // 0x003A
    bool m_disableRendererWhenPlayEnd; // 0x003B
    bool loop; // 0x003C
    bool unscaledTime; // 0x003D
    bool randomZRotation; // 0x003E
    uint8_t pad_003F[0x1]; // 0x003F
    Coroutine* bayt; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayu; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayv; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Color bayw; // 0x0050
    uint8_t pad_0051[0xF]; // 0x0051
    bool bayx; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    WaitForSeconds* bayy; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    WaitForSecondsRealtime* bayz; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float baza; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnAnimationStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnAnimationComplete; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    System.Action<System.Int32> OnFrameChanged; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Action* OnDelayStart; // 0x0098
    uint8_t pad_0099[0x7]; // 0x0099
    Action* OnDelayComplete; // 0x00A0

    // Methods
    SpriteRenderer* dxm();  // RVA: 0x63C8B0
    System.Collections.Generic.List<UnityEngine.Sprite> dxn();  // RVA: 0x6809D0
    float dxo();  // RVA: 0x7F90D0
    float dxp();  // RVA: 0x7F90E0
    bool dxq();  // RVA: 0x7F9D40
    bool dxr();  // RVA: 0x7F9100
    int32_t dxs();  // RVA: 0x7F9110
    int32_t dxt();  // RVA: 0x7F9D50
    float dxu();  // RVA: 0x7F9D90
    void Start();  // RVA: 0x7F9C20
    void OnEnable();  // RVA: 0x7F9B00
    void OnDisable();  // RVA: 0x7F9A60
    void dxv();  // RVA: 0x7F9DE0
    void dxw();  // RVA: 0x7F9E70
    void OnValidate();  // RVA: 0x7F9B70
    void dxx();  // RVA: 0x7F9F70
    void dxy();  // RVA: 0x7FA070
    void dxz();  // RVA: 0x7FA120
    void dya(int32_t a);  // RVA: 0x7FA190
    void dyb();  // RVA: 0x7FA290
    void dyc();  // RVA: 0x7FA2E0
    WaitForSeconds* dyd(float a);  // RVA: 0x7FA340
    WaitForSecondsRealtime* dye(float a);  // RVA: 0x7FA410
    IEnumerator* dyf();  // RVA: 0x7FA4E0
    void dyg(float a, float b, bool c);  // RVA: 0x7FA550
    void dyh(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7FA5D0
    void dyi(Sprite* a);  // RVA: 0x7FA720
    void dyj(int32_t a);  // RVA: 0x7FA7B0
    void dyk();  // RVA: 0x7FA840
    void dyl();  // RVA: 0x632CB0
    void .ctor();  // RVA: 0x7F9CB0
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static UnityAction* <>9__15_0;


    // Methods
    static void .cctor();  // RVA: 0x7FC490
    void .ctor();  // RVA: 0x628380
    void dym();  // RVA: 0x7FC500
};

// Namespace: <global>
class BottomStageQuickMenu : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool bazb; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* m_quickMenu; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    ScreenBoundsCorrector* m_screenBoundsCorrector; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float m_bottomOnTopPos; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float m_bottomOnBottomPos; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    oj* m_quickMenuHoverCheck; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Button* m_nonPresetButton; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Button* m_pinBattleScreenButton; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_pinBattleScreenText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Button* m_muteButton; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    TextMeshProUGUI* m_muteText; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Button* m_alwaysOnTopButton; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    TextMeshProUGUI* m_alwaysOnTopText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    System.Collections.Generic.List<TaskbarHero.UI.LayoutPresetButton> m_layoutPresetButtons; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    bool bazc; // 0x0088

    // Methods
    void dyn();  // RVA: 0x7F2E60
    void dyo(bool a);  // RVA: 0x7F3AE0
    void dyp(bool a);  // RVA: 0x7F3B60
    void dyq(bool a);  // RVA: 0x7F3C40
    void dyr(ESoundType a, float b);  // RVA: 0x7F3D20
    void Update();  // RVA: 0x7F2E00
    void OnDisable();  // RVA: 0x628640
    void OnPointerClick(PointerEventData* eventData);  // RVA: 0x7F2C30
    void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x7F2DF0
    void OnPointerExit(PointerEventData* eventData);  // RVA: 0x628640
    void .ctor();  // RVA: 0x628650
    void dys();  // RVA: 0x7F3E50
};

// Namespace: <global>
class StageTooltip : public MonoBehaviour
{
public:
    // Static fields
    // static int32_t bazd;
    // static int32_t baze;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_titleText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_stageTypeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    TextMeshProUGUI* m_stageLevelText; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* m_BG; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite[][] m_bgSprites; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    GameObject* m_soulStoneBG; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Image* m_soulStoneIcon; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_soulStoneAmountText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    SpriteAnimation_Image* m_bluePortalAnim; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    SpriteAnimation_Image* m_redPortalAnim; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    GameObject* m_lockIcon; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    GameObject* m_bottomText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    TextMeshProUGUI* m_bottomTextLabel; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    GameObject* m_mouseIcon; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    TextMeshProUGUI* m_enterText; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Color m_normalColor; // 0x0098
    uint8_t pad_0099[0xF]; // 0x0099
    Color m_actBossColor; // 0x00A8

    // Methods
    void Show(StageCache* cache);  // RVA: 0x7FA8B0
    void Hide();  // RVA: 0x737D30
    void dyt();  // RVA: 0x7FAD70
    void dyu(StageCache* a, int32_t b);  // RVA: 0x7FAED0
    void dyv(bool a, bool b);  // RVA: 0x7FB180
    void dyw(SpriteAnimation_Image* a, SpriteAnimation_Image* b, bool c);  // RVA: 0x7FB1B0
    void dyx(StageCache* a, bool b, bool c, bool d, int32_t e);  // RVA: 0x7FB2D0
    void dyy(bool a, Il2CppString* b, Color c);  // RVA: 0x7FB610
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class OfflineHeroSlot
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* slotObject; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    TextMeshProUGUI* nameText; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    TextMeshProUGUI* levelText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* expText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* baseExp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* addedExp; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* levelUpFX; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.List<UnityEngine.GameObject> heroList; // 0x0048

    // Methods
    void .ctor();  // RVA: 0x7F6FE0
};

// Namespace: <global>
struct <ShowLevelUpFX>d__21
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    UI_OfflineReward* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> list; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7FC0E0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FBC10
};

// Namespace: <global>
class UI_OfflineReward : public MonoBehaviour
{
public:
    // Static fields
    // static float bazf;
    // static float bazg;
    // static EEquipClassType[][] bazh;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_lastLoginText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_offlineTimeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Slider* m_timeSlider; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    TextMeshProUGUI* m_goldText; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* m_blockBG; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    OfflineHeroSlot[][] heroSlots; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    CanvasGroup* m_parentCanvasGroup; // 0x0050

    // Methods
    void dyz(OfflineRewardResult a);  // RVA: 0x7FE120
    void dza(bool a);  // RVA: 0x7FE400
    void dzb(OfflineRewardResult a);  // RVA: 0x7FE420
    void dzc(OfflineRewardResult a);  // RVA: 0x7FE6A0
    void dzd(OfflineRewardResult a);  // RVA: 0x7FE760
    void dze(OfflineHeroSlot* a, OfflineRewardHeroResult b);  // RVA: 0x7FEAE0
    void dzf(OfflineHeroSlot* a, HeroInfoData* b);  // RVA: 0x7FF000
    int32_t dzg(HeroInfoData* a);  // RVA: 0x7FF1C0
    HeroInfoData* dzh(int32_t a);  // RVA: 0x7FF2A0
    float dzi(float a, float b);  // RVA: 0x7FF390
    UniTaskVoid dzj(System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> a);  // RVA: 0x7FF3C0
    void OnDisable();  // RVA: 0x7FDEE0
    void .ctor();  // RVA: 0x628650
    static void .cctor();  // RVA: 0x7FE090
    bool dzk();  // RVA: 0x7FF470
};

// Namespace: <global>
struct EStatusUIState
{
public:
    // Static fields
    // static EStatusUIState Default;
    // static EStatusUIState StatDetail;
    // static EStatusUIState AttributeDetail;
    // static EStatusUIState SkillEquip;
    // static EStatusUIState SkillSlot;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EWorldUILocation
{
public:
    // Static fields
    // static EWorldUILocation Left;
    // static EWorldUILocation Center;
    // static EWorldUILocation Right;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class UI_Main : public MonoBehaviour
{
public:
    // Static fields
    // static float bazj;
    // static float bazk;
    // static float bazl;
    // static float bazm;

    uint8_t pad_0000[0x20]; // 0x0000
    UIManager* bazi; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UiStateMachineBehaviour* _usm; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RectTransform* panel_left; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    RectTransform* panel_right; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    RectTransform* panel_center; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    xs* button_Stash; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    xs* button_Stat; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    xs* button_Cube; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    xs* button_Rune; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    xs* button_Portal; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    System.Collections.Generic.List<xs> ContentButtons; // 0x0070

    // Methods
    void Awake();  // RVA: 0x7FCDD0
    void dzl();  // RVA: 0x7FD1A0
    void Start();  // RVA: 0x7FD070
    void OnEnable();  // RVA: 0x7FD070
    void dzm();  // RVA: 0x7FD2B0
    EWorldUILocation dzn(float a);  // RVA: 0x7FD520
    bool dzo();  // RVA: 0x7FD540
    bool dzp();  // RVA: 0x7FD5C0
    void dzq();  // RVA: 0x7FD640
    void dzr(float a);  // RVA: 0x7FD680
    void dzs(float a);  // RVA: 0x7FD730
    void dzt(float a);  // RVA: 0x7FD7E0
    void dzu();  // RVA: 0x7FD890
    void dzv();  // RVA: 0x7FD890
    void dzw();  // RVA: 0x7FD9F0
    void dzx();  // RVA: 0x7FDAD0
    void dzy();  // RVA: 0x7FDAE0
    void dzz();  // RVA: 0x7FDD30
    void eaa();  // RVA: 0x7FDEB0
    void eab();  // RVA: 0x7FDEB0
    void .ctor();  // RVA: 0x7FD120
};

// Namespace: <global>
class bg : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Vector2 bazn; // 0x0020

    // Methods
    void hcf(Vector2 a);  // RVA: 0x800280
    void mlz(float a);  // RVA: 0x800270
    void byp(Vector2 a);  // RVA: 0x800270
    void gvg(Vector2 a);  // RVA: 0x800270
    void .ctor();  // RVA: 0x628650
    void exv(Vector2 a);  // RVA: 0x800280
    void eyq(Vector2 a);  // RVA: 0x800280
    void eac(Vector2 a);  // RVA: 0x800280
    void eae(float a);  // RVA: 0x800270
    void lkr(Vector2 a);  // RVA: 0x800270
    void gue(float a);  // RVA: 0x800270
    void ead(Vector2 a);  // RVA: 0x800270
};

// Namespace: <global>
struct <UpdateCoolTimeAsync>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bh* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FC990
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FBC10
};

// Namespace: <global>
class bh
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float bazo; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t bazp; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    System.Action<System.Int32> bazq; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CancellationTokenSource* bazr; // 0x0020

    // Methods
    void nco();  // RVA: 0x8002C0
    void .ctor(int32_t a);  // RVA: 0x800290
    void czy();  // RVA: 0x8002C0
    void elq();  // RVA: 0x8004C0
    bool eag();  // RVA: 0x800320
    UniTaskVoid eaj();  // RVA: 0x800430
    void eai();  // RVA: 0x8002C0
    float eaf();  // RVA: 0x800310
    void eah();  // RVA: 0x800330
    void luc();  // RVA: 0x8002C0
    void ldk();  // RVA: 0x8002C0
};

// Namespace: <global>
class bi
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazs; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x628380
};

// Namespace: <global>
class bj
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazt; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bazu; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    DeadUnitData* bazv; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67B210
    void eak();  // RVA: 0x632CB0
    bool MoveNext();  // RVA: 0x8005C0
    Il2CppObject* eal();  // RVA: 0x68F440
    void eam();  // RVA: 0x800750
    Il2CppObject* ean();  // RVA: 0x68F440
};

// Namespace: <global>
class DeadUnitData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ug* cache; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float currentResurrectionTime; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Action<System.Single> OnProcessChange; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Coroutine* resurrectionCoroutine; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t bazw; // 0x0030

    // Methods
    int32_t eao();  // RVA: 0x7F4840
    void .ctor(ug* cache, int32_t dieOrder);  // RVA: 0x7F46F0
    void eap();  // RVA: 0x7F4850
    void eaq();  // RVA: 0x7F4920
    IEnumerator* ear();  // RVA: 0x7F49A0
};

// Namespace: <global>
class ObstacleScriptableObject : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    System.Collections.Generic.List<System.Single> ObstacleMoveSpeeds; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x6C0B00
};

// Namespace: <global>
class SkillSO : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    SKILLTYPE skillTYPE; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float preTime; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float actionTime; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float postTime; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool KeepActivateOnRecast; // 0x0028
    bool CanMultiCastSkill; // 0x0029
    uint8_t pad_002A[0x6]; // 0x002A
    PrefabAndOffSetEffect* SkillEf_StartEf_Me; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    PrefabAndOffSetEffect* SkillEf_Direct_Other; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    PrefabAndOffSetEffect* AreaOfEffect_Other_Hitted; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    PrefabAndOffSetProjecTile* SkillProjecTile; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    AreaOfEffectData AreaOfEffectObject; // 0x0050
    uint8_t pad_0051[0x17]; // 0x0051
    bcp* WillSpawnTurret; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    bl* WillSpawnTrap; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float WillSpawnTrapFixedY; // 0x0078
    uint8_t pad_0079[0x3]; // 0x0079
    float WillSpawnTrapSpeed; // 0x007C
    uint8_t pad_007D[0x3]; // 0x007D
    float WillSpawnTrapRandPosOffsetDividedRange; // 0x0080
    uint8_t pad_0081[0x3]; // 0x0081
    float WillSpawnTrapRandPosOffsetIncrementDividedRange; // 0x0084
    uint8_t pad_0085[0x3]; // 0x0085
    float WillSpawnTrapRandPosMaxOffsetDividedRange; // 0x0088
    uint8_t pad_0089[0x3]; // 0x0089
    float WillFinalOffsetXDividedRange_Move; // 0x008C
    uint8_t pad_008D[0x3]; // 0x008D
    float WillFinalOffsetXDividedRange_NotMove; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    SpawnSomethingData SpawnSomethingData; // 0x0098
    uint8_t pad_0099[0x17]; // 0x0099
    MonsterRandomSpawnData RandomMonsterSpawnData; // 0x00B0
    uint8_t pad_00B1[0x17]; // 0x00B1
    Sprite* SkillSprite; // 0x00C8
    uint8_t pad_00C9[0x7]; // 0x00C9
    AnimationClip* SkillClip1; // 0x00D0
    uint8_t pad_00D1[0x7]; // 0x00D1
    AnimationClip* SkillClip2; // 0x00D8
    uint8_t pad_00D9[0x7]; // 0x00D9
    AnimationClip* SkillClip3; // 0x00E0

    // Methods
    bool eas();  // RVA: 0x7F8E60
    bool eat();  // RVA: 0x7F8E70
    bool eau();  // RVA: 0x7F8E80
    bool eav();  // RVA: 0x7F8E90
    bool eaw();  // RVA: 0x7F8EA0
    bool eax();  // RVA: 0x7F8EB0
    bool eay();  // RVA: 0x7F8EC0
    void .ctor();  // RVA: 0x7F8E50
};

// Namespace: <global>
struct SpawnSomethingData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* SpawnPrefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 Offset; // 0x0018
};

// Namespace: <global>
struct MonsterRandomSpawnData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<System.Int32> RandomSpawnMonsterKey; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t SpawnCount; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float RandomSpawnPosOffsetMin; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float RandomSpawnPosOffsetMax; // 0x0020
};

// Namespace: <global>
struct AreaOfEffectData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018
};

// Namespace: <global>
class PrefabAndOffSetEffect
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7F7060
};

// Namespace: <global>
class PrefabAndOffSetProjecTile
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bdc* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7F7060
};

// Namespace: <global>
class TrapExplosionData : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    EDamageAttribute ReactDamageType; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bbj* AreaOfEffect; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* ExplosionTriggerName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float DividedExplosionDelayTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    int32_t DamageIncreaseValue; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    StatusEffectType StatusEffectType; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float StatusEffectChance; // 0x003C

    // Methods
    void .ctor();  // RVA: 0x6C0B00
};

// Namespace: <global>
struct <ActivatingExplosion>d__31
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bk* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TrapExplosionData* data; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7FB740
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FBC10
};

// Namespace: <global>
class bk : public bl
{
public:
    uint8_t pad_0000[0x48]; // 0x0000
    TrapExplosionData[][] ExplosionData; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Unit* bazx; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    System.Collections.Generic.Dictionary<TaskbarHero.Data.EDamageAttribute,TrapExplosionData> bazy; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    float bazz; // 0x0060
    uint8_t pad_0061[0x3]; // 0x0061
    EDamageAttribute bbaa; // 0x0064
    uint8_t pad_0065[0x3]; // 0x0065
    EDamageType bbab; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    TrapExplosionData* bbac; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    bool bbad; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    CancellationTokenSource* bbae; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* bbaf; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    int32_t bbag; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    int32_t bbah; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    int32_t bbai; // 0x0098

    // Methods
    UniTaskVoid ebm(TrapExplosionData* a);  // RVA: 0x800E10
    void jum(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x800880
    bool eba();  // RVA: 0x673A00
    void ebj(DamageInfo a, bool b);  // RVA: 0x800B70
    Transform* ebd();  // RVA: 0x800870
    void idy(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x800880
    Unit* ebc();  // RVA: 0x62FB20
    void iej(int32_t a, int32_t b, int32_t c);  // RVA: 0x8008D0
    void fem();  // RVA: 0x800DB0
    void ebi(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x8009F0
    DamageInfo igc();  // RVA: 0x801180
    void ebk();  // RVA: 0x800D20
    Vector3 eaz();  // RVA: 0x800810
    Bounds ebp();  // RVA: 0x8010B0
    DamageInfo ebn();  // RVA: 0x800EC0
    void ghz(int32_t a, int32_t b, int32_t c);  // RVA: 0x8008D0
    void ebl();  // RVA: 0x800DB0
    Vector3 ebq();  // RVA: 0x62C430
    int32_t ebr();  // RVA: 0x801170
    DamageInfo kzq();  // RVA: 0x801340
    void oma(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x800880
    void ebe(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x800880
    float ebo();  // RVA: 0x801080
    void ebf(int32_t a, int32_t b, int32_t c);  // RVA: 0x8008D0
    void jvo(float a);  // RVA: 0x8009A0
    void ebh(float a);  // RVA: 0x8009A0
    void ebg(EDamageAttribute a);  // RVA: 0x8008F0
    void ias(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x800880
    void ihl();  // RVA: 0x800DB0
    void .ctor();  // RVA: 0x800790
    void fve(int32_t a, int32_t b, int32_t c);  // RVA: 0x8008D0
    DamageableType ebb();  // RVA: 0x800860
};

// Namespace: <global>
struct <UpdateTrapLifeTime>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bl* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FCB90
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FBC10
};

// Namespace: <global>
class bl : public bci
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Animator* TrapAnimator; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bdh* TrapMover; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float LifeTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float TrapMoveSpeed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    float TrapMoveHeight; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool bbaj; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    CancellationTokenSource* bbak; // 0x0040

    // Methods
    void ebv();  // RVA: 0x801A70
    void OnDisable();  // RVA: 0x801500
    void ebs();  // RVA: 0x8018E0
    void btd();  // RVA: 0x801500
    void ktm();  // RVA: 0x801500
    void .ctor();  // RVA: 0x801520
    void ohz();  // RVA: 0x801500
    void ebi(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x801530
    UniTaskVoid ebt();  // RVA: 0x801960
    void ebu();  // RVA: 0x8019F0
    void jhk();  // RVA: 0x801500
    void ebk();  // RVA: 0x801890
    void iyz();  // RVA: 0x801AB0
};

// Namespace: <global>
struct <UpdateAsync>d__15
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    LineController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FC530
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FBC10
};

// Namespace: <global>
class LineController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool OnlyOneLoop; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    LineRenderer* LineRenderer; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Texture[][] lineTextures; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float Fps; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteRenderer* m_headCap; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteRenderer* m_tailCap; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float bbal; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    int32_t bbam; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    bool bban; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Transform* bbao; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    Transform* bbap; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Vector3 bbaq; // 0x0070
    uint8_t pad_0071[0xB]; // 0x0071
    Vector3 bbar; // 0x007C

    // Methods
    void ebw();  // RVA: 0x7F6670
    void ebx(Transform* a, Transform* b, Vector3 c, Vector3 d);  // RVA: 0x7F66D0
    UniTaskVoid eby();  // RVA: 0x7F6980
    void ebz(Vector3 a, Vector3 b);  // RVA: 0x7F6A00
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class bm : public bz
{
public:
    uint8_t pad_0000[0x38]; // 0x0000
    float FloorHalfSize; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    System.Collections.Generic.List<UnityEngine.GameObject> Presets; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    FollowCamera* FollowCamera; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float ObstacleMoveSpeed; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float TimeCorrectionValue; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float bbas; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    int32_t bbat; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    System.Collections.Generic.List<bo> ChildLayers; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    int32_t bbau; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbav; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    Transform* bbaw; // 0x0070

    // Methods
    void eca(Vector3 a, float b, int32_t c);  // RVA: 0x802690
    void ecb();  // RVA: 0x8029F0
    void brt();  // RVA: 0x802310
    void End();  // RVA: 0x801B30
    void gas(Transform* a);  // RVA: 0x803AD0
    void Hide();  // RVA: 0x801D20
    void Update();  // RVA: 0x801D80
    void .ctor();  // RVA: 0x8020A0
    void jme();  // RVA: 0x801D50
    void kvx(Vector3 a, float b, int32_t c);  // RVA: 0x804520
    void ixk(Vector3 a, float b, int32_t c);  // RVA: 0x803FD0
    void ecd(Transform* a);  // RVA: 0x802E00
    void erg();  // RVA: 0x803660
    void czs();  // RVA: 0x8024A0
    void kqy();  // RVA: 0x804330
    void bpu();  // RVA: 0x802120
    void Show();  // RVA: 0x801D50
    void eoh(Vector3 a, float b, int32_t c);  // RVA: 0x803300
    void ehd(Transform* a);  // RVA: 0x803080
    void gxn(Transform* a);  // RVA: 0x803D50
    void faj(Transform* a);  // RVA: 0x803850
    void ecc(Transform* a);  // RVA: 0x802B80
    void hxb();  // RVA: 0x801D20
};

// Namespace: <global>
class bn : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Camera* bbax; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UI_Stage* bbay; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    bool OnHover; // 0x0030

    // Methods
    void dwf();  // RVA: 0x804940
    void mst();  // RVA: 0x804AF0
    void kcl();  // RVA: 0x804910
    void .ctor();  // RVA: 0x628650
    void ldr();  // RVA: 0x8049D0
    void lgf();  // RVA: 0x804A60
    void Start();  // RVA: 0x804880
    void Update();  // RVA: 0x804910
};

// Namespace: <global>
class bo : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x628650
    void ecf();  // RVA: 0x804CC0
    void ece();  // RVA: 0x804B80
    void ior();  // RVA: 0x804DD0
};

// Namespace: <global>
class bp : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<UnityEngine.GameObject> BackGroundPresets; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    FollowCamera* FollowCamera; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float ObstacleMoveSpeed; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 bbaz; // 0x0040

    // Methods
    void ecg(Vector3 a);  // RVA: 0x8052D0
    void lne();  // RVA: 0x805D10
    void mmj(Vector3 a);  // RVA: 0x806230
    void jal(Vector3 a);  // RVA: 0x805940
    void fsp();  // RVA: 0x8057F0
    void Awake();  // RVA: 0x804F10
    void Update();  // RVA: 0x8050A0
    void lu(Vector3 a);  // RVA: 0x805E60
    void .ctor();  // RVA: 0x628650
    void fsc();  // RVA: 0x8056A0
    void End();  // RVA: 0x804F50
};

// Namespace: <global>
class bq
{
public:
    // Static fields
    // static Il2CppString* bbba;
    // static Il2CppString* bbbb;
    // static Il2CppString* bbbc;
    // static Il2CppString* bbbd;
    // static Il2CppString* bbbe;
    // static Il2CppString* bbbf;
    // static Il2CppString* bbbg;


    // Methods
    static void .cctor();  // RVA: 0x806600
};

// Namespace: <global>
class br
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* bbbh; // 0x0010

    // Methods
    bool mwc(Il2CppString* a);  // RVA: 0x8067B0
    bool ech(Il2CppString* a);  // RVA: 0x8067B0
    bool fqe(Il2CppString* a);  // RVA: 0x8067B0
    void .ctor();  // RVA: 0x628380
    bool gjt(Il2CppString* a);  // RVA: 0x8067B0
    bool oif(Il2CppString* a);  // RVA: 0x8067B0
};

// Namespace: <global>
class CsvManager : public MonoBehaviour
{
public:
    // Static fields
    // static CsvManager* bbbi;

    uint8_t pad_0000[0x20]; // 0x0000
    Il2CppString* m_csvFolderPath; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.TextAsset> m_csvTextAssets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.Dictionary<System.String,UnityEngine.TextAsset> bbbj; // 0x0030

    // Methods
    static CsvManager* eci();  // RVA: 0x7F43B0
    void Awake();  // RVA: 0x7F4250
    void ecj();  // RVA: 0x7F43F0
    System.Collections.Generic.List<a> eck(Il2CppString* a);  // RVA: 0x419570
    TextAsset* ecl(Il2CppString* a);  // RVA: 0x7F4580
    String[][] ecm(Il2CppString* a);  // RVA: 0x7F45E0
    void .ctor();  // RVA: 0x7F42B0
};

// Namespace: <global>
class FollowCamera : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    StageManager* _stageController; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Unit[][] _targets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector3 _battleModeOffset; // 0x0030
    uint8_t pad_0031[0xF]; // 0x0031
    RectTransform* m_stageUIRect; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    BoxCollider2D* m_collider2D; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Vector3 windowFrameOffset; // 0x0050
    uint8_t pad_0051[0xB]; // 0x0051
    Vector3 bbbk; // 0x005C
    uint8_t pad_005D[0xB]; // 0x005D
    float bbbl; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbbm; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    float m_monsterTargetOffsetValue; // 0x0070
    uint8_t pad_0071[0x3]; // 0x0071
    float m_monsterFollowCameraCenterOffset; // 0x0074
    uint8_t pad_0075[0x3]; // 0x0075
    Vector3 m_windowFrameMonsterBattleFollowOffset; // 0x0078
    uint8_t pad_0079[0xB]; // 0x0079
    Vector3 m_windowFrameCorrectionOffset; // 0x0084
    uint8_t pad_0085[0xB]; // 0x0085
    float m_heroSpreadMaxDistance; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    float m_heroSpreadTargetOffsetX; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    float m_maxFollowDistance; // 0x0098
    uint8_t pad_0099[0x3]; // 0x0099
    float m_catchUpSpeedMultiplier; // 0x009C
    uint8_t pad_009D[0x3]; // 0x009D
    float bbbn; // 0x00A0
    uint8_t pad_00A1[0x7]; // 0x00A1
    TMP_InputField* m_debugCorrectionOffsetXInput; // 0x00A8
    uint8_t pad_00A9[0x7]; // 0x00A9
    TMP_InputField* m_debugCorrectionOffsetYInput; // 0x00B0
    uint8_t pad_00B1[0x7]; // 0x00B1
    TMP_InputField* m_debugCorrectionOffsetZInput; // 0x00B8

    // Methods
    Transform* ecn();  // RVA: 0x7F4E40
    Vector3 eco();  // RVA: 0x7F4E70
    float ecp();  // RVA: 0x7F4EB0
    void Start();  // RVA: 0x7F4D80
    void ecq();  // RVA: 0x7F4EC0
    void ecr(Il2CppString* a);  // RVA: 0x7F51C0
    void ecs(Il2CppString* a);  // RVA: 0x7F5200
    void ect(Il2CppString* a);  // RVA: 0x7F5240
    void Update();  // RVA: 0x7F4D90
    void ecu();  // RVA: 0x7F5280
    void ecv(float a);  // RVA: 0x7F5550
    void ecw(Unit[][] a);  // RVA: 0x7F5560
    Vector3 ecx();  // RVA: 0x7F5820
    Vector3 ecy();  // RVA: 0x7F5930
    Vector3 ecz();  // RVA: 0x7F5A40
    void eda(Vector3 a);  // RVA: 0x7F5F40
    void .ctor();  // RVA: 0x7F4DA0
};

// Namespace: <global>
class TestFollowScript : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Transform* m_stageUIRect; // 0x0020

    // Methods
    void Update();  // RVA: 0x80DB30
    void .ctor();  // RVA: 0x628650
};

// Namespace: <global>
class AnimationEf : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spr; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_SpriteRenderer* sprite_Animation; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> additionalAnimations; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Action* bbbo; // 0x0038
